{
  "number": 35,
  "name": "Miden'Nir",
  "lifespan": 60,
  "rooms": {
    "3500": {
      "vnum": 3500,
      "name": "The Plains",
      "description": "This area is the plains. This is a vast desolate place where the wind\ncan howl undisturbed since nothing but you bars its way. However you are\nnot the first to wander here. before somebody has left a small path. The\npath looks rather bewildered and is not the kind of path to lead to\nanywhere significant or important but it seems to have made up its mind\nto enter the hills far away north. A narrow trail scars its way off to\nthe east as it leads up towards a hillside. Buildings crowd together on\nall sides. The cobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 4000,
          "description": "A rocky path climbs toward The Hills"
        },
        "east": {
          "to_room": 3300,
          "description": "A steep trail ascends to A Scraggly Trail"
        },
        "south": {
          "to_room": 3501,
          "description": "The cobblestones lead to The Lane"
        }
      }
    },
    "3501": {
      "vnum": 3501,
      "name": "The Lane",
      "description": "The area is strolling along a pleasant, shady lane. The road is lined on\nboth sides by tall, stately trees which lend the scene with a sense of\nquiet serenity. You can follow the road north or south. The sounds of\ncity life echo around. The smell of smoke and humanity hangs in the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3500,
          "description": "The cobblestones lead to The Plains"
        },
        "south": {
          "to_room": 3502,
          "description": "The cobblestones lead to The Laneway"
        }
      }
    },
    "3502": {
      "vnum": 3502,
      "name": "The Laneway",
      "description": "The trees stand close here, and the tall, bushy undergrowth prevents you\nfrom seeing far in any direction save east, where a broad lane continues\noff into the distance; and west, where the same lane continues towards\nwhat looks like a fairly large city. The muted sounds of city commotion\nreach your ears from a distance; stray dogs barking, children crying,\nand street salesmen shouting. A steep path leads down from here to the\nnortheast towards the Dwarven Village, and a small trail leads through\nthe trees towards the hills to the north. Buildings crowd together on\nall sides. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3501,
          "description": "The cobblestones lead to The Lane"
        },
        "east": {
          "to_room": 15000,
          "description": "You see a fairly large road leading towards a grand castle in the distance."
        },
        "west": {
          "to_room": 3503,
          "description": "The cobblestones lead to The City Entrance"
        },
        "down": {
          "to_room": 6500,
          "description": "The well trodden path leads down to the northeast towards a small bustling village."
        }
      }
    },
    "3503": {
      "vnum": 3503,
      "name": "The City Entrance",
      "description": "The area opens on the outskirts of a large city - Midgaard; the capital\nof this land. The road leads east into the peace and quiet - and dangers\n- of the forest; and to the west it becomes the main street of the town;\nsurrounded by a confusion of shops, bars, and market places. The sounds\nof city life echo around. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [
        "no_mob"
      ],
      "exits": {
        "east": {
          "to_room": 3502,
          "description": "The cobblestones lead to The Laneway"
        },
        "west": {
          "to_room": 3053,
          "description": "The cobblestones lead to Outside The East Gate Of Midgaard"
        }
      }
    },
    "3504": {
      "vnum": 3504,
      "name": "The South Gate",
      "description": "This area is a small, dusty path leading away from the south gate of\nMidgaard, to the forest of Miden'Nir (Goblinic for 'Green Blood'). You\ncan still see the city to the east, but if you go south, there is fresh\nair and greenery. Branches intertwine overhead, filtering the light. The\nforest floor is carpeted with fallen leaves.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3127,
          "description": "You can see the walls of the South Gate."
        },
        "south": {
          "to_room": 3505,
          "description": "If you go south, you will enter the Miden'Nir."
        }
      }
    },
    "3505": {
      "vnum": 3505,
      "name": "The Trail To Miden'Nir",
      "description": "This is a light forest. A path leads south, but the passage to the east\nis easy enough. To the west, smoke can be seen rising above the\ntreetops. The sprawl of Midgaard lies north of here. Bird calls echo\nthrough the canopy. Branches intertwine overhead, filtering the light.",
      "sector_type": "forest",
      "flags": [
        "no_mob"
      ],
      "exits": {
        "north": {
          "to_room": 3504,
          "description": "To the north, you see the South Gate of Midgaard."
        },
        "east": {
          "to_room": 3506,
          "description": "More light forest."
        },
        "south": {
          "to_room": 3507,
          "description": "This path cuts through the darkness of the Miden'Nir."
        },
        "west": {
          "to_room": 3570,
          "description": "The Woodsman's Inn can be seen a short distance to the west, it appears to be the source of the smoke."
        }
      }
    },
    "3506": {
      "vnum": 3506,
      "name": "The Miden'nir",
      "description": "This is a dark forest. To the east, mountains block passage. From here,\nonly the lighter forest to the west or south offer a way to travel. The\nscent of pine and earth fills the air. Branches intertwine overhead,\nfiltering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3550,
          "description": "The mountains can be seen jutting up to the east."
        },
        "south": {
          "to_room": 3509,
          "description": "The forest is darker to the south."
        },
        "west": {
          "to_room": 3505,
          "description": "The forest gets lighter as you go west."
        }
      }
    },
    "3507": {
      "vnum": 3507,
      "name": "The Miden'nir",
      "description": "The forest is deep here and the wind blows through the trees and through\nyour hair. To the north, the forest gets lighter. However, the southern\nand western paths place you even deeper in the wood. The scent of pine\nand earth fills the air. Ancient trees rise on all sides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3505,
          "description": "The forest is lighter in this direction."
        },
        "south": {
          "to_room": 3510,
          "description": "More and darker woods."
        },
        "west": {
          "to_room": 3508,
          "description": "There is a small path leading west."
        }
      }
    },
    "3508": {
      "vnum": 3508,
      "name": "On a Small Path",
      "description": "A path is here, leading east and south through the dark woods of\nMiden'nir. Mountains slash the scenery to the west of here. Bird calls\necho through the canopy. The forest floor is carpeted with fallen\nleaves.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3507,
          "description": "Wind-swept forest."
        },
        "south": {
          "to_room": 3511,
          "description": "To the south, the trail continues."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        }
      ]
    },
    "3509": {
      "vnum": 3509,
      "name": "The Miden'nir",
      "description": "The trees of Miden'nir are lush and green, hiding the evil that lurks in\nthese woods. The trees become too thick to the west, but you may go\nnorth, south or travel toward the mountains that lie east of here. Bird\ncalls echo through the canopy. Branches intertwine overhead, filtering\nthe light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3506,
          "description": "The trees lighten up a bit this way."
        },
        "east": {
          "to_room": 3512,
          "description": "Huge grey mountains lie in this direction."
        },
        "south": {
          "to_room": 3514,
          "description": "The forest continues."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        },
        {
          "vnum": 3501,
          "max": 10
        }
      ]
    },
    "3510": {
      "vnum": 3510,
      "name": "A Crossroads",
      "description": "Here footworn paths meet leading north, south and east. The trees seem\nto be closing in on you at this point, and you can barely see the sky\nthrough the thick branches above your head. Bird calls echo through the\ncanopy. Ancient trees rise on all sides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3507,
          "description": "Trees as far as the eye can see."
        },
        "east": {
          "to_room": 3514,
          "description": "There is an especially dark part of the forest this way."
        },
        "south": {
          "to_room": 3516,
          "description": "There is an especially dark section of forest this way."
        }
      }
    },
    "3511": {
      "vnum": 3511,
      "name": "The Trail",
      "description": "The area is a north-south trail through the woods. To the west,\nimpassable mountains glare at you, and the thick woods and undergrowth\nprevent any movement westward. Ancient trees rise on all sides. Branches\nintertwine overhead, filtering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3508,
          "description": "The trail bends to the north."
        },
        "south": {
          "to_room": 3515,
          "description": "To the south, the path re-enters the forest."
        }
      }
    },
    "3512": {
      "vnum": 3512,
      "name": "The Miden'nir",
      "description": "The trees of Miden'nir are lush and green, hiding the evil that lurks in\nthese woods. You can go north toward the mountains, or west to the\nforest, but the steep mountains prevent any movement east. The scent of\npine and earth fills the air. The forest floor is carpeted with fallen\nleaves.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3550,
          "description": "The mountains can be seen to the north."
        },
        "south": {
          "to_room": 3513,
          "description": "A light section of forest."
        },
        "west": {
          "to_room": 3509,
          "description": "The forest continues here."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        },
        {
          "vnum": 3501,
          "max": 10
        },
        {
          "vnum": 3501,
          "max": 10
        }
      ]
    },
    "3513": {
      "vnum": 3513,
      "name": "The Miden'nir",
      "description": "The forest is dark, and becomes even darker west. You sense that there\nis something evil hidden in these woods. The forest gets lighter to the\nnorth. The wind kicks up as you ponder your options. The forest floor is\ncarpeted with fallen leaves. Bird calls echo through the canopy.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3512,
          "description": "There is a small clearing to the north."
        },
        "west": {
          "to_room": 3514,
          "description": "It gets darker and thicker this way."
        }
      }
    },
    "3514": {
      "vnum": 3514,
      "name": "The Deep Forest",
      "description": "It is quite dark here, forest surrounds you. With each step, the forest\nseems to close around, and get darker and more foreboding. It might\njust be time to head back to somewhere safe. Branches intertwine\noverhead, filtering the light. The scent of pine and earth fills the\nair.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3509,
          "description": "More forest."
        },
        "east": {
          "to_room": 3513,
          "description": "Lighter forest and mountains in the distance."
        },
        "south": {
          "to_room": 3517,
          "description": "More trees."
        },
        "west": {
          "to_room": 3510,
          "description": "The forest continues."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        }
      ]
    },
    "3515": {
      "vnum": 3515,
      "name": "The Light Forest",
      "description": "The forest is light here and you can easily pick your way through the\ntrail. To the east, the forest becomes thick and darker. South, the\ntrail continues. Branches intertwine overhead, filtering the light. The\nforest floor is carpeted with fallen leaves.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3511,
          "description": "A trail leading north-south."
        },
        "east": {
          "to_room": 3516,
          "description": "The trees get thicker as you go east."
        },
        "south": {
          "to_room": 3518,
          "description": "More trees and some small hills."
        }
      }
    },
    "3516": {
      "vnum": 3516,
      "name": "Some Muddy Ground",
      "description": "The ground is quite muddy here and puddles are all around. Your boots\nmake a disgusting SQUISH as you walk here. You can go in any of the four\ncardinal directions from here. Hopefully, it will be dryer. Bird calls\necho through the canopy. Ancient trees rise on all sides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3510,
          "description": "The Miden'nir continues."
        },
        "east": {
          "to_room": 3517,
          "description": "More trees."
        },
        "south": {
          "to_room": 3519,
          "description": "The trees get VERY thick to the south.  You can barely see..."
        },
        "west": {
          "to_room": 3515,
          "description": "Some light trees and daylight."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        }
      ]
    },
    "3517": {
      "vnum": 3517,
      "name": "Near The Mountains",
      "description": "The most prominent feature here is the mountains that lie to the east.\nYou can only go north and west from here as the rocks stop all other\nmovement. Bird calls echo through the canopy. Branches intertwine\noverhead, filtering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3514,
          "description": "Many trees to the north."
        },
        "west": {
          "to_room": 3516,
          "description": "There is a bit of a slope downward to the west."
        }
      }
    },
    "3518": {
      "vnum": 3518,
      "name": "The Fading Trail",
      "description": "The trail becomes nearly unpassable here. You can go north as the forest\nis relatively light. To the south, Visible is a path. The forest floor\nis carpeted with fallen leaves. Bird calls echo through the canopy.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3515,
          "description": "You can see a trail this way."
        },
        "south": {
          "to_room": 3522,
          "description": "Dark forests."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        }
      ]
    },
    "3519": {
      "vnum": 3519,
      "name": "The Dark Path",
      "description": "The area is hemmed in by trees on either side of you. The path continues\nnorth and south, and while is much to thick to explore west, you can\nhead off into the woods to the west. Branches intertwine overhead,\nfiltering the light. The scent of pine and earth fills the air.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3516,
          "description": "The forest gets lighter this way."
        },
        "east": {
          "to_room": 3520,
          "description": "The forest continues."
        },
        "south": {
          "to_room": 3521,
          "description": "There is a strong stench coming from this direction."
        }
      }
    },
    "3520": {
      "vnum": 3520,
      "name": "The Dark Forest",
      "description": "You stomp your way through the underbrush. The dark forest of Miden'nir\nget pretty thick here, and the branches high above your head are so\nthick that they block out all direct sunlight. While it is much too\nthick to go further east, you might be able to make your way though the\nforest to the south and west. Branches intertwine overhead, filtering\nthe light. The scent of pine and earth fills the air.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "south": {
          "to_room": 3523,
          "description": "The thick forest continues."
        },
        "west": {
          "to_room": 3519,
          "description": "The thick forest continues."
        }
      }
    },
    "3521": {
      "vnum": 3521,
      "name": "The Carnage",
      "description": "Here, you see a gruesome sight. Blood is everywhere... on the trees and\nsoaked into the ground. Two carcasses lie ahead, seeming to look up at\nyou. The forest is impassible to the south, but the other directions\nlook ok. Ancient trees rise on all sides. The scent of pine and earth\nfills the air.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3519,
          "description": "Darkness..."
        },
        "east": {
          "to_room": 3523,
          "description": "Your light does not extend that far."
        },
        "west": {
          "to_room": 3522,
          "description": "More dark forest."
        }
      },
      "extra_descs": {
        "": "carcass body corpse carcasses bodies corpses"
      },
      "mob_resets": [
        {
          "vnum": 3500,
          "max": 3
        },
        {
          "vnum": 3500,
          "max": 3
        },
        {
          "vnum": 3500,
          "max": 3
        }
      ],
      "obj_resets": [
        {
          "vnum": 3505,
          "max": 2
        },
        {
          "vnum": 3506,
          "max": 1
        },
        {
          "vnum": 3505,
          "max": 2
        }
      ]
    },
    "3522": {
      "vnum": 3522,
      "name": "Deep In The Forest Of Miden'nir",
      "description": "There is a sickening stench here. It smells of blood and death. To the\nnorth, you catch glimpses of daylight. To the east, you simply cannot\nsee. The trees are close and stifling. Ancient trees rise on all sides.\nThe forest floor is carpeted with fallen leaves.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3518,
          "description": "You see daylight and a trail to follow."
        },
        "east": {
          "to_room": 3521,
          "description": "The stench seems to becoming from this direction."
        }
      }
    },
    "3523": {
      "vnum": 3523,
      "name": "The Dark Forest",
      "description": "The branches above block out all direct sunlight, making the forest\nin this area rather dark. The forest continues east, where it meets the\nmountains. The air is still and stuffy - a stench comes from the west\nand an ugly feeling causes the hair to rise on the back of your neck!\nThe scent of pine and earth fills the air. Ancient trees rise on all\nsides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3520,
          "description": "It appears to get much darker that direction."
        },
        "east": {
          "to_room": 3551,
          "description": "The forest appears to get much darker in this direction."
        },
        "west": {
          "to_room": 3521,
          "description": "The sky becomes lighter in this direction."
        }
      }
    },
    "3550": {
      "vnum": 3550,
      "name": "At The Foot Of The Mountains",
      "description": "The passage opens at the foot of the mountains, where it is much to\nsteep to continue north or east. You see the lush, green forest of\nMiden'nir to the south and west. The path is steep and treacherous. The\nair is thin and cold at this altitude.",
      "sector_type": "mountain",
      "flags": [],
      "exits": {
        "south": {
          "to_room": 3512,
          "description": "The forest of Miden'nir spreads out before you."
        },
        "west": {
          "to_room": 3506,
          "description": "The forest of Miden'nir spreads out before you."
        }
      }
    },
    "3551": {
      "vnum": 3551,
      "name": "Deep In The Forest Of Miden'nir",
      "description": "The branches above block out all direct sunlight, making the forest\nin this area very dark. The forest continues west, but mountains block\nfurther exploration in all other directions, except south, where you\nnotice a small tunnel dug into the mountainside. Ancient trees rise on\nall sides. The forest floor is carpeted with fallen leaves.",
      "sector_type": "forest",
      "flags": [
        "dark"
      ],
      "exits": {
        "south": {
          "to_room": 3552,
          "description": "The tunnel leads into the mountainside."
        },
        "west": {
          "to_room": 3523,
          "description": "The forest continues, but appears to be getting lighter."
        }
      },
      "mob_resets": [
        {
          "vnum": 3502,
          "max": 4
        }
      ]
    },
    "3552": {
      "vnum": 3552,
      "name": "A Tunnel In The Mountains",
      "description": "The walls of this tunnel were carved out many years ago by the goblins\nof this forest. The floor is well worn, and continues south, into the\nmountain, or back north out into the forest. The smell of smoke and\nhumanity hangs in the air. The sounds of city life echo around.",
      "sector_type": "city",
      "flags": [
        "dark"
      ],
      "exits": {
        "north": {
          "to_room": 3551,
          "description": "Outside, you see the forest of Miden'nir."
        },
        "south": {
          "to_room": 3553,
          "description": "The tunnel continues to the south."
        }
      }
    },
    "3553": {
      "vnum": 3553,
      "name": "A Tunnel In The Mountains",
      "description": "The tunnel gets lighter to the north, presumably leading out, while to\nthe south the passage gets smaller and smaller. A small alcove has been\ncarved into the east wall. The sounds of city life echo around. The\ncobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [
        "dark"
      ],
      "exits": {
        "north": {
          "to_room": 3552,
          "description": "The tunnel gets wider in this direction."
        },
        "east": {
          "to_room": 3554,
          "description": "You see a small alcove."
        },
        "south": {
          "to_room": 3555,
          "description": "The tunnel gets smaller in this direction."
        }
      }
    },
    "3554": {
      "vnum": 3554,
      "name": "A Small Alcove",
      "description": "A small alcove has been carved out here. There are a bunch of twigs and\nleaves thrown into a pile here, probably serving as a bed. Buildings\ncrowd together on all sides. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [
        "dark"
      ],
      "exits": {
        "west": {
          "to_room": 3553,
          "description": "You see the main passageway."
        }
      },
      "extra_descs": {
        "": "twigs leaves bead"
      }
    },
    "3555": {
      "vnum": 3555,
      "name": "A Tunnel In The Mountains",
      "description": "As you explore further into the mountainside, the tunnel gets smaller\nand smaller to the south. You almost have to hunch over to make your way\nthrough this area. A small archway to the south leads into a large\nchamber. The cobblestones are worn smooth by countless feet. The smell\nof smoke and humanity hangs in the air.",
      "sector_type": "city",
      "flags": [
        "dark"
      ],
      "exits": {
        "north": {
          "to_room": 3553,
          "description": "The tunnel continues north."
        },
        "south": {
          "to_room": 3556,
          "description": "You see a small cavern."
        }
      }
    },
    "3556": {
      "vnum": 3556,
      "name": "The Goblin HeadQuarters",
      "description": "The tunnel widens into a large (well, large for goblins) cavern that\nserves as the living quarters for the goblins of Miden'nir. The bones of\nnumbers woodland creatures are strewn about the room, the remanents of a\nrecent meal. Buildings crowd together on all sides. Vendors and\npedestrians bustle past.",
      "sector_type": "city",
      "flags": [
        "dark"
      ],
      "exits": {
        "north": {
          "to_room": 3555,
          "description": "The tunnel heads north."
        }
      },
      "mob_resets": [
        {
          "vnum": 3501,
          "max": 10
        },
        {
          "vnum": 3502,
          "max": 4
        },
        {
          "vnum": 3503,
          "max": 1
        }
      ]
    },
    "3570": {
      "vnum": 3570,
      "name": "The Front Of The Inn",
      "description": "This area is a well-worn path which opens into a clearing. An old,\nwooden building is here with smoke billowing from its chimney. A painted\nsign is visible on the porch to the west. You could go north or south\naround the building or leave this place and return to the forest. The\nscent of pine and earth fills the air. Branches intertwine overhead,\nfiltering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3571,
          "description": "You can go north around the Inn."
        },
        "east": {
          "to_room": 3505,
          "description": "Back through the trees to the Miden'nir."
        },
        "south": {
          "to_room": 3572,
          "description": "You can go south around the Inn."
        },
        "west": {
          "to_room": 3574,
          "description": "The front door of the Inn beckons."
        }
      },
      "extra_descs": {
        "": "sign"
      }
    },
    "3571": {
      "vnum": 3571,
      "name": "North Of The Inn",
      "description": "The area opens north of the Inn. Things don't look much different from\nthis angle. The air here is filled with smells of smoke and cooking.\nSouth, the front porch is waiting for you... or Visible is if there is a\nback door. Branches intertwine overhead, filtering the light. The scent\nof pine and earth fills the air.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "south": {
          "to_room": 3570,
          "description": "You see the front of the Inn."
        }
      }
    },
    "3572": {
      "vnum": 3572,
      "name": "South Of The Inn",
      "description": "The area opens south of the Inn. You could easily go north and enter\nthrough the front door, or west and to the rear of the establishment.\nYou here some muffled cries from a tiny trail leading south of here. The\nforest floor is carpeted with fallen leaves. The scent of pine and earth\nfills the air.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3570,
          "description": "This way leads to the front of the Inn."
        },
        "south": {
          "to_room": 3575,
          "description": "The trail heads south."
        },
        "west": {
          "to_room": 3573,
          "description": "This way leads to the back of the Inn."
        }
      }
    },
    "3573": {
      "vnum": 3573,
      "name": "Behind The Inn",
      "description": "You now stand behind the Inn. The smell here is not so pleasant as the\nkeeper and his help throw a good deal of garbage here. A couple of piles\nof rubbish are to the west, but you will smell the worse for meddling\nthere. As a clean alternative, you can go north or east around the Inn.\nThe forest floor is carpeted with fallen leaves. The scent of pine and\nearth fills the air.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3572,
          "description": "You can go around the Inn this way."
        },
        "west": {
          "to_room": 3578,
          "description": "Only rats and fool adventurers play in garbage."
        }
      }
    },
    "3574": {
      "vnum": 3574,
      "name": "The Woodsman Inn",
      "description": "This is the common room of the Woodsman Inn. A thin haze of smoke sits\nin the air here. The Inn is often empty, as the forest has become\noverrun by goblins as of late, and it is no longer safe in these parts.\nThe bar is just north of here. If you'd rather have your own table, one\nis empty to the south. The smell of smoke and humanity hangs in the air.\nBuildings crowd together on all sides.",
      "sector_type": "city",
      "flags": [
        "no_mob",
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 3576,
          "description": "The bar is here, manned by the Innkeeper."
        },
        "east": {
          "to_room": 3570,
          "description": "You can leave now and return to fresher air."
        },
        "south": {
          "to_room": 3579,
          "description": "An empty table is a rare commodity."
        },
        "west": {
          "to_room": 3577,
          "description": "There is a table to the south occupied by a heavy drinker."
        }
      }
    },
    "3575": {
      "vnum": 3575,
      "name": "The Ambush Point",
      "description": "This is a overgrown foot-trail south of the Inn. It leads west, but you\nwould be hard pressed to follow it far. A number of bushes are trampled\non and some medium sized branches have been knocked down. Obviously\nthere has been a battle here rather recently. The forest floor is\ncarpeted with fallen leaves. Ancient trees rise on all sides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3572,
          "description": "The Inn lies to the north."
        },
        "west": {
          "to_room": 3581,
          "description": "A trail through the woods."
        }
      },
      "mob_resets": [
        {
          "vnum": 3504,
          "max": 1
        }
      ]
    },
    "3576": {
      "vnum": 3576,
      "name": "The Bar",
      "description": "This is where people use to come and enjoy the food, drink and\nhospitality of the Innkeeper, but as of late, he only serves the few\nadventurers that manage to survive a trip through the forest. You can\nleave south and return to the common room. The sounds of city life echo\naround. The cobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [
        "indoors",
        "soundproof"
      ],
      "exits": {
        "south": {
          "to_room": 3574,
          "description": "You may retreat south back to the common room."
        }
      },
      "mob_resets": [
        {
          "vnum": 3505,
          "max": 1
        }
      ]
    },
    "3577": {
      "vnum": 3577,
      "name": "The Bard's Table",
      "description": "This is a darker corner in the Inn. A large round table with a few\nwooden chairs sits here. There is a large stain on the table, the\nremnants of a spilled drink. Vendors and pedestrians bustle past.\nBuildings crowd together on all sides.",
      "sector_type": "city",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 3574,
          "description": "You see the main floor of the Inn to the east."
        }
      },
      "mob_resets": [
        {
          "vnum": 3506,
          "max": 1
        }
      ]
    },
    "3578": {
      "vnum": 3578,
      "name": "The Garbage Dump",
      "description": "The area opens knee deep in garbage. YECCH!!! It smells terrible and who\nknows what vermin live in these piles of filth... Bird calls echo\nthrough the canopy. Ancient trees rise on all sides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3573,
          "description": "You can return to cleaner lands this way."
        }
      }
    },
    "3579": {
      "vnum": 3579,
      "name": "A Quieter Section Of The Inn",
      "description": "There seems to be no one in this end of the Woodsman, probably a safe\nplace to rest and lick your wounds... The air is still and musty. The\nwalls are rough-hewn and cold to the touch.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 3574,
          "description": "You see the common room."
        }
      }
    },
    "3581": {
      "vnum": 3581,
      "name": "On The Trail Of The Horsemen",
      "description": "The path continues east and west of here. You notice fresh tracks in the\nsoft ground that show the horsemen fled to the west. Ancient trees rise\non all sides. Branches intertwine overhead, filtering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3575,
          "description": "Back to ambush point."
        },
        "west": {
          "to_room": 3582,
          "description": "The trail continues."
        }
      }
    },
    "3582": {
      "vnum": 3582,
      "name": "On The Trail Of The Horsemen",
      "description": "The path continues east and south. You notice fresh tracks in the soft\nground that show the horsemen turned, and fled south. The forest floor\nis carpeted with fallen leaves. Ancient trees rise on all sides.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3581,
          "description": "The trail continues."
        },
        "south": {
          "to_room": 3583,
          "description": "The tracks lead south."
        }
      }
    },
    "3583": {
      "vnum": 3583,
      "name": "On The Trail Of The Horsemen",
      "description": "The trail of the horsemen continues east and north along this path\nthrough the forest. The tracks are still fresh, so they must be near.\nBird calls echo through the canopy. Branches intertwine overhead,\nfiltering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 3582,
          "description": "The trail continues."
        },
        "west": {
          "to_room": 3584,
          "description": "The tracks lead east."
        }
      }
    },
    "3584": {
      "vnum": 3584,
      "name": "A Dead End Trail",
      "description": "The path comes to an abrupt end here, as the trees close around and\nmake any further exploration impossible. Fresh tracks cover the ground,\nand end right here. The horsemen must be nearby. The scent of pine and\nearth fills the air. Branches intertwine overhead, filtering the light.",
      "sector_type": "forest",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 3583,
          "description": "Back to along the trail."
        }
      },
      "mob_resets": [
        {
          "vnum": 3507,
          "max": 4
        },
        {
          "vnum": 3507,
          "max": 4
        }
      ]
    }
  },
  "mobs": {
    "3500": {
      "vnum": 3500,
      "name": "wyvern",
      "short_desc": "the wyvern",
      "long_desc": "A monstrous wyvern slowly circles just above your head.",
      "level": 8,
      "alignment": -700,
      "hp_dice": "8d10+112",
      "damage_dice": "3d5+5",
      "gold": 1787,
      "exp": 480,
      "armor_class": 76,
      "flags": [
        "sentinel",
        "stay_zone",
        "aggr_good",
        "no_bash"
      ],
      "description": "This huge winged creature looks really menacing as it circles only inches\nabove your head, flapping its wings and squawking very loudly."
    },
    "3501": {
      "vnum": 3501,
      "name": "goblin",
      "short_desc": "the goblin",
      "long_desc": "A mountain goblin is wandering around mumbling to himself...",
      "level": 4,
      "alignment": -250,
      "hp_dice": "4d10+64",
      "damage_dice": "2d4+3",
      "gold": 325,
      "exp": 240,
      "armor_class": 88,
      "flags": [
        "aggressive",
        "stay_zone",
        "memory",
        "helper"
      ],
      "description": "You see before you a small and twisted creature with knotted muscles and\ndisgustingly green skin.  Doesn't look like the type you'd invite to dinner.",
      "equipment": {
        "wield": 3502
      }
    },
    "3502": {
      "vnum": 3502,
      "name": "goblin",
      "short_desc": "the goblin lieutenant",
      "long_desc": "A goblin lieutenant stands here, attempting to get his men in order.",
      "level": 7,
      "alignment": -600,
      "hp_dice": "7d10+100",
      "damage_dice": "2d5+6",
      "gold": 1150,
      "exp": 420,
      "armor_class": 79,
      "flags": [
        "stay_zone",
        "aggr_good",
        "memory",
        "helper"
      ],
      "description": "The goblin lieutenant is rather angry, and looking for one of his men to\nbeat up upon, but maybe you will do just fine...",
      "equipment": {
        "wield": 3500
      }
    },
    "3503": {
      "vnum": 3503,
      "name": "the Goblin King",
      "short_desc": "Grukthar the Goblin King",
      "long_desc": "Grukthar the Goblin King towers over his throne, snarling.",
      "level": 22,
      "alignment": -900,
      "hp_dice": "22d10+280",
      "damage_dice": "6d8+8",
      "gold": 4500,
      "exp": 1320,
      "armor_class": 34,
      "flags": [
        "helper",
        "boss",
        "aggr_good",
        "sentinel",
        "memory",
        "scavenger"
      ],
      "description": "The leader doesn't look too happy that you have found him here.  He grabs\nfor his shortsword and lunges for your neck.",
      "equipment": {
        "wield": 3504
      },
      "boss": true,
      "boss_id": "goblin_king",
      "boss_title": "the Goblinbane",
      "boss_achievement": "boss_goblin_king",
      "boss_loot_table": [
        3509,
        3510,
        3511
      ],
      "boss_loot_chance": 85,
      "boss_config": {
        "enrage_time": 60,
        "enrage_multiplier": 1.5,
        "ability_interval": 4.0,
        "phases": [
          {
            "threshold": 70,
            "message": "The Goblin King beats his chest and calls for reinforcements!",
            "spawn_adds": {
              "3501": 2,
              "3502": 2
            }
          },
          {
            "threshold": 40,
            "message": "The Goblin King flies into a berserk rage!"
          }
        ],
        "abilities": [
          {
            "name": "Bomb Toss",
            "telegraph": "The Goblin King lights a crude bomb and hurls it high!",
            "cast_time": 2,
            "cooldown": 12,
            "damage_dice": "4d6+8",
            "dodge": true,
            "aoe": true,
            "vulnerable_after": 3
          },
          {
            "name": "Summon Lackeys",
            "cooldown": 18,
            "summon": {
              "3501": 1,
              "3502": 2
            }
          }
        ]
      }
    },
    "3504": {
      "vnum": 3504,
      "name": "boy",
      "short_desc": "the small boy",
      "long_desc": "A small boy sits here, licking his wounds.",
      "level": 4,
      "alignment": 500,
      "hp_dice": "4d10+64",
      "damage_dice": "2d4+3",
      "gold": 300,
      "exp": 240,
      "armor_class": 88,
      "flags": [
        "sentinel",
        "wimpy"
      ],
      "description": "The poor boy has numerous cuts and scratches, but appears to be all right.\nHe is apparently the only survivor of the ambush.",
      "equipment": {
        "hold": 3508
      }
    },
    "3505": {
      "vnum": 3505,
      "name": "innkeeper",
      "short_desc": "the Innkeeper",
      "long_desc": "The Innkeeper stands here, cleaning glasses.",
      "level": 10,
      "alignment": 400,
      "hp_dice": "10d10+136",
      "damage_dice": "3d6+6",
      "gold": 4250,
      "exp": 600,
      "armor_class": 70,
      "flags": [
        "sentinel",
        "stay_zone",
        "memory",
        "helper"
      ],
      "description": "The Innkeeper now spends most of his days waiting for customers, while the\nnights are spent watching out for goblins.  His inn is no longer the happy\nplace that is used to be in days past."
    },
    "3506": {
      "vnum": 3506,
      "name": "bard",
      "short_desc": "the bard",
      "long_desc": "A sullen bard is here, drinking away his problems.",
      "level": 8,
      "alignment": 600,
      "hp_dice": "2d8+40",
      "damage_dice": "1d6+6",
      "gold": 2625,
      "exp": 223,
      "armor_class": 3,
      "flags": [
        "sentinel",
        "stay_zone",
        "memory",
        "helper"
      ],
      "description": "You can smell the alcohol on his breath from across the room.  This poor\nbard has been sitting here quite a while, drinking himself into oblivion.",
      "equipment": {
        "wield": 3502
      }
    },
    "3507": {
      "vnum": 3507,
      "name": "horseman",
      "short_desc": "the dark horseman",
      "long_desc": "A dark horseman is here, mounted on his black steed.",
      "level": 8,
      "alignment": -900,
      "hp_dice": "8d10+112",
      "damage_dice": "3d5+5",
      "gold": 2500,
      "exp": 480,
      "armor_class": 76,
      "flags": [
        "stay_zone",
        "wimpy",
        "helper"
      ],
      "description": "The man is obviously an outlaw, and has no qualms about slashing you into\nlittle bits.",
      "equipment": {
        "body": 3503
      }
    }
  },
  "objects": {
    "3500": {
      "vnum": 3500,
      "name": "sword",
      "short_desc": "a small sword",
      "room_desc": "A small sword lies here.",
      "item_type": "weapon",
      "weight": 3,
      "value": 60,
      "damage_dice": "1d6",
      "weapon_type": "pierce",
      "type": "weapon"
    },
    "3501": {
      "vnum": 3501,
      "name": "sword",
      "short_desc": "a fine long sword",
      "room_desc": "A long sword has been left here.",
      "item_type": "weapon",
      "weight": 8,
      "value": 600,
      "damage_dice": "1d9",
      "weapon_type": "slash",
      "type": "weapon"
    },
    "3502": {
      "vnum": 3502,
      "name": "club",
      "short_desc": "a wooden club",
      "room_desc": "A simple looking wooden club is here.",
      "item_type": "weapon",
      "weight": 3,
      "value": 12,
      "damage_dice": "1d3",
      "weapon_type": "pound",
      "type": "weapon"
    },
    "3503": {
      "vnum": 3503,
      "name": "jacket",
      "short_desc": "a studded leather jacket",
      "room_desc": "A studded leather jacket is lying on the ground.",
      "item_type": "armor",
      "weight": 20,
      "value": 500,
      "armor_bonus": 5,
      "type": "armor",
      "wear_slot": "body",
      "armor": 1
    },
    "3504": {
      "vnum": 3504,
      "name": "spear",
      "short_desc": "a small spear",
      "room_desc": "A small spear lies here.",
      "item_type": "weapon",
      "weight": 15,
      "value": 500,
      "damage_dice": "5d1",
      "weapon_type": "pierce",
      "type": "weapon"
    },
    "3505": {
      "vnum": 3505,
      "name": "corpse",
      "short_desc": "a mutilated corpse",
      "room_desc": "A mutilated corpse has been left on the ground here.",
      "item_type": "container",
      "weight": 25,
      "value": 0,
      "capacity": 20,
      "type": "trash"
    },
    "3506": {
      "vnum": 3506,
      "name": "corpse",
      "short_desc": "a mutilated corpse",
      "room_desc": "A mutilated corpse has been left on the ground here.",
      "item_type": "container",
      "weight": 25,
      "value": 0,
      "capacity": 20,
      "type": "trash"
    },
    "3507": {
      "vnum": 3507,
      "name": "dagger",
      "short_desc": "an ornate dagger",
      "room_desc": "A beautiful looking dagger is stuck in the ground.",
      "item_type": "weapon",
      "weight": 4,
      "value": 1000,
      "damage_dice": "3d3",
      "weapon_type": "pierce",
      "type": "weapon"
    },
    "3508": {
      "vnum": 3508,
      "name": "gyroscope",
      "short_desc": "the gyroscope",
      "room_desc": "A small toy is spinning about on the ground here.",
      "item_type": "armor",
      "weight": 1,
      "value": 25,
      "armor_bonus": 5,
      "type": "treasure"
    },
    "3509": {
      "vnum": 3509,
      "name": "a jagged goblin crown",
      "short_desc": "a jagged goblin crown",
      "room_desc": "A jagged crown fashioned from scrap metal lies here.",
      "type": "armor",
      "weight": 2,
      "cost": 900,
      "armor": 6,
      "wear_slot": "head"
    },
    "3510": {
      "vnum": 3510,
      "name": "a bomb satchel",
      "short_desc": "a bomb satchel",
      "room_desc": "A soot-stained satchel of goblin bombs sits here.",
      "type": "container",
      "weight": 5,
      "cost": 600,
      "capacity": 20
    },
    "3511": {
      "vnum": 3511,
      "name": "a kingly cleaver",
      "short_desc": "a kingly cleaver",
      "room_desc": "A brutal cleaver etched with goblin runes lies here.",
      "type": "weapon",
      "weight": 10,
      "cost": 1200,
      "damage_dice": "2d7+2",
      "weapon_type": "slash"
    }
  }
}