{
  "number": 120,
  "name": "Rome",
  "lifespan": 45,
  "rooms": {
    "12001": {
      "vnum": 12001,
      "name": "The Judging Booth",
      "description": "The area opens in the midst of a small room with windows on the east and\nsouth walls. These windows provide a complete view of the competition\nfields. There are several scorecards, pencils and other items that are\nused by the judges sitting on a table. The only exit is a trapdoor\nleading down. The air is still and musty. Shadows gather in the corners.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "down": {
          "to_room": 12002,
          "description": "There is a rickety ladder leading down.",
          "door": {
            "name": "trapdoor",
            "state": "closed",
            "locked": false,
            "key_vnum": 12033
          }
        },
        "north": {
          "to_room": 5001,
          "description": "You see an exit north."
        }
      },
      "extra_descs": {
        "": "pencils pencil"
      },
      "mob_resets": [
        {
          "vnum": 12000,
          "max": 3
        },
        {
          "vnum": 12000,
          "max": 3
        },
        {
          "vnum": 12000,
          "max": 3
        },
        {
          "vnum": 12001,
          "max": 1
        }
      ]
    },
    "12002": {
      "vnum": 12002,
      "name": "Caesar's Private Box",
      "description": "This is the best view in the house! Visible is gladiators fighting or\nthe chariot races with an unobstructed view. The seats are upholstered\nin red velvet and are in top-notch condition. There is a rickety ladder\nleading up and a marble staircase leading down. The air is still and\nmusty. The ceiling hangs low overhead.",
      "sector_type": "inside",
      "flags": [
        "no_mob",
        "indoors"
      ],
      "exits": {
        "up": {
          "to_room": 12001,
          "description": "You see a rickety ladder with a trapdoor leading up.",
          "door": {
            "name": "trapdoor",
            "state": "closed",
            "locked": false,
            "key_vnum": 12033
          }
        },
        "down": {
          "to_room": 12003,
          "description": "There is a marble staircase leading down."
        }
      },
      "mob_resets": [
        {
          "vnum": 12004,
          "max": 3
        }
      ]
    },
    "12003": {
      "vnum": 12003,
      "name": "The West Side Of The Commoner's Seating Area",
      "description": "This is the western side commoner's seating area. There are row upon row\nof rough wooden benches bolted to the floor. There is stadium garbage\neverywhere and the smell makes you want to puke. Stairs lead up to\nCaesar's private box, a small ramp leads down to the playing field and a\nhallway leads south. The cobblestones are worn smooth by countless feet.\nVendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "south": {
          "to_room": 12004,
          "description": "You see a small hallway that leads to a larger area."
        },
        "up": {
          "to_room": 12002,
          "description": "Watch your step!"
        },
        "down": {
          "to_room": 12010,
          "description": "Watch your step!"
        }
      },
      "extra_descs": {
        "": "seats benches"
      },
      "mob_resets": [
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12003,
          "max": 10
        }
      ]
    },
    "12004": {
      "vnum": 12004,
      "name": "The Southern Commoner's Seats",
      "description": "This is the southeastern part of the common seating areas. The benches\nhere are made of stone and are probably centuries old. A few scratches\non one of the benches catch your eye. An acrid smell is coming from the\neast and a tunnel leads off to the north. The smell of smoke and\nhumanity hangs in the air. The cobblestones are worn smooth by countless\nfeet.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12003,
          "description": "The tunnel looks like it leads to another seating area."
        },
        "east": {
          "to_room": 12011,
          "description": "There is an acrid smell coming from that direction."
        }
      },
      "extra_descs": {
        "": "marks scratches"
      },
      "mob_resets": [
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12016,
          "max": 3
        }
      ]
    },
    "12005": {
      "vnum": 12005,
      "name": "The Abandoned Gate",
      "description": "This used to be a gateway to and from western Rome. There is an iron\ngate blocking your way and judging by the amount of rust and foliage\ngrowing on the bars, it hasn't been open for years. Looking through the\ngate at the barren landscape that lies beyond, Visible is why. A dirt\nroad leads off to the east, and a store is directly south. The sounds of\ncity life echo around. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12012,
          "description": "Through the clouds of dust, you can make out a passable road."
        },
        "south": {
          "to_room": 12006,
          "description": "You can barely make out a storefront through the foliage."
        }
      },
      "extra_descs": {
        "": "gate"
      },
      "mob_resets": [
        {
          "vnum": 12018,
          "max": 5
        }
      ]
    },
    "12006": {
      "vnum": 12006,
      "name": "Swords 'R  Us",
      "description": "Welcome to the weaponshop of Titus Andronicus!! Rare halberds, whips,\nswords and other instruments of death are proudly displayed on the walls\nand in gleaming glass cases. More common weapons are stacked like wood\non the floor. To the north you can barely make out a gate. There is a\nvery secure looking door to the south. Shadows gather in the corners.\nThe walls are rough-hewn and cold to the touch.",
      "sector_type": "inside",
      "flags": [
        "indoors",
        "no_magic"
      ],
      "exits": {
        "north": {
          "to_room": 12005,
          "description": "You can see a city gate to the north."
        },
        "south": {
          "to_room": 12007,
          "description": "There is a very secure looking door blocking your progress.",
          "door": {
            "name": "door",
            "state": "open",
            "locked": true,
            "key_vnum": 12034
          }
        }
      },
      "extra_descs": {
        "": "swords weapons armor halberds whips"
      },
      "mob_resets": [
        {
          "vnum": 12005,
          "max": 5
        },
        {
          "vnum": 12011,
          "max": 1
        },
        {
          "vnum": 12019,
          "max": 3
        }
      ]
    },
    "12007": {
      "vnum": 12007,
      "name": "The Back Room",
      "description": "If you thought that there were a lot of weapons in the front of the\nstore, you haven't seen anything yet!! There is barely enough room to\nwalk amongst the crates of armor and swords. No wonder Rome will stand\nfor a thousand years. The only exit is through a door to the north. The\nwalls are rough-hewn and cold to the touch. Dust motes drift in the\nstale air.",
      "sector_type": "inside",
      "flags": [
        "dark",
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12006,
          "description": "Through the piles of weapons, you can see a door leading north to the rest of  the store.",
          "door": {
            "name": "door",
            "state": "open",
            "locked": true,
            "key_vnum": 12034
          }
        }
      },
      "extra_descs": {
        "": "weapons swords crates armor weapon sword crate"
      },
      "mob_resets": [
        {
          "vnum": 12026,
          "max": 1
        }
      ]
    },
    "12008": {
      "vnum": 12008,
      "name": "Peanut Heaven",
      "description": "The area is now so high up that you begin to feel lightheaded and your\nnose feels like it is going to start bleeding. There aren't even benches\nto sit on here; just bare dirty stone. The view of the surrounding\ncountry is spectacular. Unfortunately you can barely see the playing\nfield. There is a set of steps here, leading down. The sounds of city\nlife echo around. The cobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "down": {
          "to_room": 12015,
          "description": "Watch your step!"
        }
      },
      "extra_descs": {
        "": "landscape country"
      },
      "mob_resets": [
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12016,
          "max": 3
        }
      ]
    },
    "12009": {
      "vnum": 12009,
      "name": "The Practice And Warm-up Area",
      "description": "There are many gladiators, chariot drivers and their coaches here,\nwarming up in preparation for the games. The dust rising from the\nparched earth makes you want to sneeze. A short tunnel leads east and\nthe thunder of pounding hooves and the clash of weapons can be heard\ncoming from the south. Tall grass sways in a gentle breeze. The air is\nfresh and clean.",
      "sector_type": "field",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12016,
          "description": "There is a large oval dirt-track in that direction."
        },
        "south": {
          "to_room": 12010,
          "description": "You can hear the clash of weapons and the thunder of hooves in that direction."
        }
      },
      "extra_descs": {
        "": "coach trainer"
      },
      "mob_resets": [
        {
          "vnum": 12006,
          "max": 5
        },
        {
          "vnum": 12006,
          "max": 5
        },
        {
          "vnum": 12007,
          "max": 4
        },
        {
          "vnum": 12008,
          "max": 1
        }
      ]
    },
    "12010": {
      "vnum": 12010,
      "name": "The Jousting Arena",
      "description": "This is a wide open grassy plane... LOOK OUT!!!! The area is almost\nskewered by a gladiator's lance as he makes his charge. A practicing\narea is due north. The air is fresh and clean. Tall grass sways in a\ngentle breeze.",
      "sector_type": "field",
      "flags": [
        "no_mob"
      ],
      "exits": {
        "north": {
          "to_room": 12009,
          "description": "Through a small tunnel you can see athletes stretching and warming up for the games."
        },
        "up": {
          "to_room": 12003,
          "description": "You see a set of steps leading up into the spectator stands."
        }
      },
      "extra_descs": {
        "": "gladiator"
      },
      "mob_resets": [
        {
          "vnum": 12006,
          "max": 5
        },
        {
          "vnum": 12006,
          "max": 5
        },
        {
          "vnum": 12006,
          "max": 5
        }
      ]
    },
    "12012": {
      "vnum": 12012,
      "name": "A Dirt Road",
      "description": "The area is a parched and dusty rural road which runs east and west.\nThere is a structure lying to the south. Tall grass sways in a gentle\nbreeze. The air is fresh and clean.",
      "sector_type": "field",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12019,
          "description": "Through the dust, you see a paved road."
        },
        "south": {
          "to_room": 12013,
          "description": "It is difficult to see through the haze and dust."
        },
        "west": {
          "to_room": 12005,
          "description": "It is difficult to see through the haze and dust."
        }
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12013": {
      "vnum": 12013,
      "name": "The Commoner's House",
      "description": "This is the main living quarters of a common Roman citizen. The\nfurnishings are sparse and it is warm here. A putrid odor is coming from\nthe east and passages lead north and south. Shadows gather in the\ncorners. The air is still and musty.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12012,
          "description": "A dusty road lies to the north."
        },
        "east": {
          "to_room": 12020,
          "description": "What is that smell??!!!  It is enough to make a yak gag!!!"
        },
        "south": {
          "to_room": 12014,
          "description": "You hazard a guess that a bedroom lies in that direction."
        }
      },
      "extra_descs": {
        "": "furnishings furniture"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12014": {
      "vnum": 12014,
      "name": "The Bedchamber",
      "description": "This is the bedroom. There is a hard and lumpy bed in the far corner. It\nlooks like the commoner's wife has been shirking her duties lately, as\nthere is a big pile of soiled laundry here. The only way out is from\nwhere you came. The air is still and musty. The walls are rough-hewn and\ncold to the touch.",
      "sector_type": "inside",
      "flags": [
        "no_mob",
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12013,
          "description": "You see the living quarters to the north."
        }
      },
      "extra_descs": {
        "": "laundry wash clothing"
      }
    },
    "12015": {
      "vnum": 12015,
      "name": "The Noblemans' Box",
      "description": "These are the 'better' seats used primarily by the upper class of Rome.\nThere is a large seating area to the east and a staircase leading up\nhere. The view of the chariot track is pretty good. The walls are rough-\nhewn and cold to the touch. The ceiling hangs low overhead.",
      "sector_type": "inside",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12022,
          "description": "Rows upon rows of bleachers lie to the east."
        },
        "up": {
          "to_room": 12008,
          "description": "The stairs look safe enough."
        }
      }
    },
    "12016": {
      "vnum": 12016,
      "name": "The Race Track",
      "description": "This is a hard dirt track about a quarter of a mile long. There are hoof\nprints everywhere, and you see a large cloud of dust approaching. You\nhad better move before get run over. A small tunnel leads west, you\ncan see the crowd to the east. You can hear loud snarls and roars coming\nfrom below. The ground is soft underfoot. The air is fresh and clean.",
      "sector_type": "field",
      "flags": [],
      "exits": {
        "west": {
          "to_room": 12009,
          "description": "You see athletes warming up and stretching."
        },
        "up": {
          "to_room": 12023,
          "description": ""
        },
        "down": {
          "to_room": 12017,
          "description": "Do you like lots of live lions that haven't been fed for a few days?"
        }
      },
      "mob_resets": [
        {
          "vnum": 12007,
          "max": 4
        },
        {
          "vnum": 12007,
          "max": 4
        },
        {
          "vnum": 12007,
          "max": 4
        }
      ]
    },
    "12017": {
      "vnum": 12017,
      "name": "The Lion Pit",
      "description": "As you land at the bottom of this dirt-walled pit, the realization that\na pit full of lions is NOT a good thing to be hanging around in. Several\nof the gladiators gather around the edge of the pit to watch your\ndemise. You look around, and all you see is tawny fur and gaping\njaws... it is too late to run, too late to hide. Twelve lions rip you\nand your belongings into a gory mass of bloodied leather, bronze, and\nbone. What's that old saying? Cats killed the curious? Something like\nthat, I'm sure... The ceiling hangs low overhead. The walls are rough-\nhewn and cold to the touch.",
      "sector_type": "inside",
      "flags": [
        "death",
        "indoors"
      ],
      "exits": {
        "up": {
          "to_room": 12010,
          "description": ""
        },
        "down": {
          "to_room": 12016,
          "description": ""
        }
      }
    },
    "12018": {
      "vnum": 12018,
      "name": "The South Entrance To The Coliseum",
      "description": "The area opens at the south entrance to the Coliseum. There are citizens\nof Rome everywhere, apparently in a mad rush to get in. A statue of\nCaligula the Mad Emperor overlooks the area. There are long lines\nstanding to the east, and an acrid smell is coming from the west. A busy\nroad lies to the south. The cobblestones are worn smooth by countless\nfeet. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [
        "no_mob"
      ],
      "exits": {
        "east": {
          "to_room": 12025,
          "description": "The lines are very long and people look impatient."
        },
        "south": {
          "to_room": 12019,
          "description": "A road lies in that direction."
        },
        "west": {
          "to_room": 12011,
          "description": "An acrid, almost medicinal smell is coming from that direction."
        }
      },
      "extra_descs": {
        "": "statue caligula"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12019": {
      "vnum": 12019,
      "name": "The Main Highway",
      "description": "This is a well built and heavily traveled road running from east to west\nand there is a large structure built entirely of stone to the north. The\nsounds of city life echo around. Vendors and pedestrians bustle\npast.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12018,
          "description": "You can hear the roar of a large crowd of people coming from that direction."
        },
        "east": {
          "to_room": 12026,
          "description": "The highway continues to the east."
        },
        "west": {
          "to_room": 12012,
          "description": "The highway continues to the west."
        }
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12020": {
      "vnum": 12020,
      "name": "The Outhouse",
      "description": "PEEEEEEEEEEEEEEEE-YEEEEEWWWWWWWW!!!!! Boy does it stink in here!!! You\ntaste bile in your mouth and your eyes begin to water. As you wipe away\nyour tears, you see that this is a small room, in the far corner of\nwhich a hole is dug. The odor intensifies as you move closer and there\nis a roll of toilet paper sitting on the ground. The only exit is to the\nwest and your nose and stomach are strongly suggesting that you use it.\nThe air is still and musty. The walls are rough-hewn and cold to the\ntouch.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "west": {
          "to_room": 12013,
          "description": "The living quarters lie in that direction.  Why don't you stop pussyfooting  around and go that way??!!  Please?"
        }
      },
      "extra_descs": {
        "": "roll paper"
      }
    },
    "12021": {
      "vnum": 12021,
      "name": "The Slave Quarters",
      "description": "This is where the slaves sleep. There are hard boards set out for use as\nbeds and not much else. The only exit is to the east. The ceiling hangs\nlow overhead. Shadows gather in the corners.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12027,
          "description": "To the east, a well manicured path winds through the nobleman's estate."
        }
      },
      "mob_resets": [
        {
          "vnum": 12005,
          "max": 5
        },
        {
          "vnum": 12005,
          "max": 5
        },
        {
          "vnum": 12005,
          "max": 5
        },
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12022": {
      "vnum": 12022,
      "name": "The Common Seating",
      "description": "This is where many of the common Roman citizens are seated during the\ngames. These are the cheapest seats in the house, as glare from the sun\nis usually a problem during the afternoon. Like the other common seating\nareas, this place could stand extensive renovation and a thorough\ncleaning. This area extends to the south and a much more elegant seating\narea can be seen to the west. The smell of smoke and humanity hangs in\nthe air. The cobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "west": {
          "to_room": 12015,
          "description": "The seating gets much fancier and elegant in that direction."
        },
        "south": {
          "to_room": 12023,
          "description": "The common seating area continues."
        }
      },
      "mob_resets": [
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12003,
          "max": 10
        }
      ]
    },
    "12023": {
      "vnum": 12023,
      "name": "The Common Seating",
      "description": "This is where many of the common Roman citizens are seated during the\ngames. Like the other commoners' areas in the coliseum, it could use\nextensive renovation and cleaning. This area extends to the north and\nlots of noise can be heard coming from the south. The cobblestones are\nworn smooth by countless feet. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12022,
          "description": "The common seating area continues."
        },
        "south": {
          "to_room": 12024,
          "description": "You see hundreds, perhaps thousands of people."
        }
      },
      "mob_resets": [
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12003,
          "max": 10
        },
        {
          "vnum": 12016,
          "max": 3
        }
      ]
    },
    "12024": {
      "vnum": 12024,
      "name": "The East Entrance To The Coliseum",
      "description": "The area opens at the east entrance to the Coliseum. There are people\neverywhere, apparently in a mad rush to get in. A statue of Tiberius, an\nEmperor of a time long since passed, stands here looking out over the\ncrowd. There is a passage to the north, the ticket booth is to the south\nand a gate opening to the city lies to the east. The cobblestones are\nworn smooth by countless feet. The smell of smoke and humanity hangs in\nthe air.",
      "sector_type": "city",
      "flags": [
        "no_mob"
      ],
      "exits": {
        "north": {
          "to_room": 12023,
          "description": "You see rows upon rows of dilapidated wooden bleachers."
        },
        "south": {
          "to_room": 12025,
          "description": "There are VERY long lines standing outside the ticket booth."
        },
        "east": {
          "to_room": 12031,
          "description": "Nero Drive lies in that direction."
        }
      },
      "extra_descs": {
        "": "statue tiberius"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12025": {
      "vnum": 12025,
      "name": "The Ticket Booth",
      "description": "Long lines are standing here, waiting to buy tickets. There are three\nvendors working furiously. Ticket stubs litter the ground and you can\nsee that the people are getting very impatient. There is a large, open\ncashbox here. Main entrances to the Coliseum are to the north and west.\nThe air is still and musty. Dust motes drift in the stale air.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12024,
          "description": "You see hundreds, if not thousands of people."
        },
        "west": {
          "to_room": 12018,
          "description": "You see hundreds, if not thousands of people."
        }
      },
      "extra_descs": {
        "": "cashbox"
      },
      "mob_resets": [
        {
          "vnum": 12015,
          "max": 3
        },
        {
          "vnum": 12015,
          "max": 3
        },
        {
          "vnum": 12015,
          "max": 3
        }
      ]
    },
    "12026": {
      "vnum": 12026,
      "name": "A Paved Road",
      "description": "The area is a paved road that runs east to west. Visible is an elaborate\nlooking estate to the south and to the north-west, off in the distance,\nVisible is a very large stone structure. Buildings crowd together on all\nsides. The sounds of city life echo around.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12033,
          "description": "The road leads off to the east."
        },
        "south": {
          "to_room": 12027,
          "description": "It looks like a Nobleman's estate.  We are talking RICH nobleman's estate."
        },
        "west": {
          "to_room": 12019,
          "description": "The road leads west towards the highway."
        }
      },
      "extra_descs": {
        "": "structure"
      }
    },
    "12027": {
      "vnum": 12027,
      "name": "A Noble Estate",
      "description": "The area is the grounds of a nobleman's estate which is hundreds of\ntimes the size and splendor of anything that a common citizen of Rome\nwould ever hope to own. Everything is lush and green. The grass is\nperfectly manicured and the trees are all bearing fruit. Ornamental\nplants are in perfectly situated to enhance and adorn the three statues\nof dedicated to gods Jupiter, Venus and Neptune. A tranquil path leads\neast and west, there is a paved road to the north and an extravagant\nhouse lies to the south. Wildflowers dot the landscape. Tall grass sways\nin a gentle breeze.",
      "sector_type": "field",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12026,
          "description": "You see a paved road in the distance."
        },
        "east": {
          "to_room": 12034,
          "description": "The path leads east through the estate."
        },
        "south": {
          "to_room": 12028,
          "description": "You see an incredible house off in the distance."
        },
        "west": {
          "to_room": 12021,
          "description": "Off through the trees, you see a small, plain hut."
        }
      },
      "extra_descs": {
        "": "trees tree shrubs shrub plants plant"
      }
    },
    "12028": {
      "vnum": 12028,
      "name": "An Opulent House",
      "description": "The area opens in a house, the size and splendor of which almost defies\nthe imagination. The floor is done with hand crafted marble tile with\nsilver and jeweled inlays. The light coming through the exquisitely\ncrafted stained glass windows bathes the room in splendor and the\nfurniture looks as though it was made by master craftsmen from all over\nthe empire. A path through the estate is north of here. The walls are\nrough- hewn and cold to the touch. The air is still and musty.",
      "sector_type": "inside",
      "flags": [
        "no_mob",
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12027,
          "description": "You see a well manicured path that winds through the estate."
        }
      },
      "extra_descs": {
        "": "furniture"
      },
      "mob_resets": [
        {
          "vnum": 12004,
          "max": 3
        }
      ]
    },
    "12029": {
      "vnum": 12029,
      "name": "The Great North Gate",
      "description": "This is the northern gateway to the city of Rome. The huge gate appears\nto be closed and locked against intrusion. A large road muddy road runs\nthrough the gate and into the countryside. Nero Drive runs south from\nhere. The sounds of city life echo around. The smell of smoke and\nhumanity hangs in the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "south": {
          "to_room": 12030,
          "description": "Nero Drive continues in that direction."
        }
      },
      "extra_descs": {
        "": "road"
      },
      "mob_resets": [
        {
          "vnum": 12018,
          "max": 5
        }
      ]
    },
    "12030": {
      "vnum": 12030,
      "name": "Nero Drive",
      "description": "A path runs through a paved road that runs south through the city of\nRome. A great gate is directly north of here. The Roman citizens are\nvery friendly and tip their hats or say hello as you pass. The sounds of\ncity life echo around. The smell of smoke and humanity hangs in the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12029,
          "description": "To the north, you can see a gate leading out of the city."
        },
        "south": {
          "to_room": 12031,
          "description": "Nero Drive continues in that direction."
        },
        "west": {
          "to_room": 12062,
          "description": "You see the bakery of Rome."
        }
      }
    },
    "12031": {
      "vnum": 12031,
      "name": "Nero Drive",
      "description": "A path runs through a great paved road that runs north and south through\nthe city. People are hurrying from one place to another, but always stop\nto say hello. Most of the people are either coming from or going to the\ntown square. Nero Drive continues to the north, and Visible is a large\nopen area to the south. The sounds of city life echo around. Vendors and\npedestrians bustle past.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12030,
          "description": "Nero drive continues in that direction."
        },
        "south": {
          "to_room": 12032,
          "description": "It looks like the town square."
        },
        "west": {
          "to_room": 12024,
          "description": "You see the an opulent estate."
        }
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12032": {
      "vnum": 12032,
      "name": "The Town Square",
      "description": "This is the middle of a large open area which is the common area of\nRome. During the day, this place is alive with the hustle and bustle of\nall of the citizens of Rome and everyone in the city is sure to stop by\nat some time or another. There are several street vendors peddling their\nwares and the overall atmosphere is carnival-like in nature. To the\nsoutheast, off in the distance, Visible is the aqueduct and the\nbuildings of the Roman government lie to the northwest. Nero Drive leads\nnorth and south from here and Clay Avenue runs east. Buildings crowd\ntogether on all sides. The smell of smoke and humanity hangs in the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12031,
          "description": "Nero Drive heads in the direction of the northern gate."
        },
        "south": {
          "to_room": 12033,
          "description": "A street made of hard packed clay runs in that direction towards the aqueduct and buildings of the Roman government."
        },
        "east": {
          "to_room": 12039,
          "description": "Nero Drive heads in the direction of the south gate."
        }
      },
      "extra_descs": {
        "": "aqueduct"
      },
      "mob_resets": [
        {
          "vnum": 12012,
          "max": 1
        },
        {
          "vnum": 12017,
          "max": 15
        },
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12033": {
      "vnum": 12033,
      "name": "Nero Drive",
      "description": "A path runs through a paved road that runs north and south through the\ncity of Rome. There are many people here, as polite as always. Most of\nthem are either coming from or going to the town square which lies to\nthe north. Nero Drive continues to the south. There is an observation\narea overlooking the aqueduct to the east and a paved road leads west.\nThe cobblestones are worn smooth by countless feet. The sounds of city\nlife echo around.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12032,
          "description": "The town square lies in that direction."
        },
        "east": {
          "to_room": 12040,
          "description": "The aqueduct and mountain of the gods are in that direction."
        },
        "south": {
          "to_room": 12034,
          "description": "Nero Drive continues toward the South Gate."
        },
        "west": {
          "to_room": 12026,
          "description": "A paved road runs west through the city."
        }
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12034": {
      "vnum": 12034,
      "name": "Nero Drive",
      "description": "This is a busy paved road that runs north through the city. The people\nof Rome are very friendly and say hello as you pass. A gate leading out\nof the city lies to the south and a small path goes west towards a\nnobleman's estate. To the east, off in the distance, lies the great\nmountain. It is rumored that the Gods watch over and protect the empire\nfrom there. The cobblestones are worn smooth by countless feet. The\nsounds of city life echo around.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12033,
          "description": "Nero Drive leads in that direction."
        },
        "south": {
          "to_room": 12035,
          "description": "You see many people entering and leaving the city through a large gate in the walls protecting the city."
        },
        "west": {
          "to_room": 12027,
          "description": "It looks like a nobleman's estate.  We are talking RICH nobleman's estate."
        }
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12035": {
      "vnum": 12035,
      "name": "The South Gate",
      "description": "This is the southern gateway to the city of Rome. The bronze gate is\nclosed and locked. Looking through the bars, you see a heavily traveled\nroad leading out of the city. Nero Drive starts here and runs north and\na wizard's shop lies to the east. The smell of smoke and humanity hangs\nin the air. The cobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12034,
          "description": "Nero Drive leads towards the center of town."
        },
        "east": {
          "to_room": 12042,
          "description": "A small store, from which an occasional detonation can be heard, lies off in that direction.  It appears to be surrounded by a rolling pink mist."
        }
      },
      "extra_descs": {
        "": "gate"
      },
      "mob_resets": [
        {
          "vnum": 12018,
          "max": 5
        }
      ]
    },
    "12036": {
      "vnum": 12036,
      "name": "The Emperor's Private Office",
      "description": "This is the Emperor's private office. The room is richly furnished with\nthe finest of the loot brought back from conquests of far away lands.\nThere is a massive, intricately carved desk here, upon which are\nimportant documents, decrees and other paperwork involved in running the\nempire. On the far wall, there is a marble bookcase that is well stocked\nwith the works of Homer, Plato, Socrates and other wise men. Further, it\nseems that the current Emperor likes flowers as there are many potted\nand cut specimens throughout the room. There is a french door leading to\nthe waiting room and a wooden door to the south. Shadows gather in the\ncorners. The walls are rough-hewn and cold to the touch.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12043,
          "description": "Through the door, you see a waiting room.",
          "door": {
            "name": "doors french",
            "state": "open",
            "locked": true,
            "key_vnum": 12035
          }
        },
        "south": {
          "to_room": 12037,
          "description": "The south door leads directly to the senate chambers.",
          "door": {
            "name": "door wooden",
            "state": "open",
            "locked": true,
            "key_vnum": 12035
          }
        }
      },
      "extra_descs": {
        "": "flowers plants flower plant"
      },
      "mob_resets": [
        {
          "vnum": 12020,
          "max": 1
        },
        {
          "vnum": 12021,
          "max": 2
        },
        {
          "vnum": 12021,
          "max": 2
        }
      ]
    },
    "12037": {
      "vnum": 12037,
      "name": "The Senate Chambers",
      "description": "This is the working room where elected senators from all over the empire\ngather to advise the Emperor. An official seal of the Emperor is hanging\non the far wall. There is a wooden door to the north and a bronze door\nto the east and doublehung door to the south. The walls are rough-hewn\nand cold to the touch. The air is still and musty.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12036,
          "description": "The door is made of thick walnut.",
          "door": {
            "name": "door wooden",
            "state": "open",
            "locked": true,
            "key_vnum": 12035
          }
        },
        "east": {
          "to_room": 12044,
          "description": "The door leads to the foyer.",
          "door": {
            "name": "door bronze",
            "state": "closed",
            "locked": false,
            "key_vnum": 12036
          }
        },
        "south": {
          "to_room": 12038,
          "description": "",
          "door": {
            "name": "door doublehung",
            "state": "closed",
            "locked": false,
            "key_vnum": 12037
          }
        }
      },
      "mob_resets": [
        {
          "vnum": 12013,
          "max": 2
        },
        {
          "vnum": 12027,
          "max": 2
        },
        {
          "vnum": 12027,
          "max": 2
        }
      ]
    },
    "12038": {
      "vnum": 12038,
      "name": "The House Of Commons",
      "description": "This is the lower house of the advising body to the Emperor. Common men\nfrom all parts of Rome work here to further assist the senators in\nadvising the Emperor on critical matters of state. The seal of the\nEmperor is painted on the far wall. The only exit is to the north. Dust\nmotes drift in the stale air. The ceiling hangs low overhead.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12037,
          "description": "You see that the doublehung door leads to the senate chambers.",
          "door": {
            "name": "door doublehung",
            "state": "closed",
            "locked": false,
            "key_vnum": 12104
          }
        }
      }
    },
    "12039": {
      "vnum": 12039,
      "name": "Clay Avenue",
      "description": "The area is a wide well traveled road running east and west through the\nheart of Rome. There are large crowds of people to the west and the road\ncontinues to the east. The aqueduct is directly south of here. The\ncobblestones are worn smooth by countless feet. The sounds of city life\necho around.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12046,
          "description": "Clay Avenue continues in that direction."
        },
        "south": {
          "to_room": 12041,
          "description": "You see an entrance to the aqueduct."
        },
        "west": {
          "to_room": 12032,
          "description": "There are large crowds of people in that direction."
        }
      },
      "extra_descs": {
        "": "crowds people"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12040": {
      "vnum": 12040,
      "name": "The Observation Lookout",
      "description": "The area is a platform overlooking a massive aqueduct. There is a\ntelescope mounted to the railing that surrounds the area and you can\nhear the gurgle of water as it is channeled into the city. Off in the\ndistance, Visible is the Mountain of the Gods. There is a sign mounted\nto the railing and a ramp leads west. The sounds of city life echo\naround. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "west": {
          "to_room": 12033,
          "description": "You can see a busy street in that direction."
        }
      },
      "extra_descs": {
        "": "sign"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12042": {
      "vnum": 12042,
      "name": "The Mage's Shop",
      "description": "This is the mage's shop. Magical ointments, charms and potions are\nsitting on shelves and behind a glass counter. There is a dense neon\nblue fog hugging the floor here, making it impossible to see below your\nknees. You suddenly hear mutterings coming from the back room, possibly\nfrom...\nKKKKKAAAAAABBBBOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOMMMMMMMMMMMMMMMM!!!!!!\nThe area is deafened by the noise from a tremendous explosion and the\nconcussion from the blast staggers you! The shopkeeper seems to pay no\nheed to this. The door to the back room opens and an older man, wearing\na pointed hat, whose face is smudged with soot sticks his head out. 'Is\neveryone alright? Sorry about that. I was testing a new spell. I'll try\nto give advance notice next time.', he says. The door then closes. The\nair is still and musty. The walls are rough-hewn and cold to the touch.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12049,
          "description": "The door is reinforced with steel and looks VERY sturdy.  Considering the 'test' that you just witnessed, you are glad that it stands between you and whatever is going on in the back room.",
          "door": {
            "name": "door",
            "state": "open",
            "locked": true,
            "key_vnum": 12038
          }
        },
        "west": {
          "to_room": 12035,
          "description": "You see the south gate through the door."
        }
      },
      "extra_descs": {
        "": "fog mist"
      },
      "mob_resets": [
        {
          "vnum": 12019,
          "max": 3
        },
        {
          "vnum": 12034,
          "max": 1
        }
      ]
    },
    "12043": {
      "vnum": 12043,
      "name": "The Waiting Room",
      "description": "This is a very large room with a high ceiling and there are a few people\nwaiting here to see the Emperor on urgent matters. The master scheduler\ntells you to have a seat and sends a page to inform the his highness of\nyour arrival. There are large doors to the east and west and an exit\nleads south to the foyer. The ceiling hangs low overhead. Shadows gather\nin the corners.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12050,
          "description": "There is a sign on the door that says:  MUNICIPAL COURT OF ROME.  It appears  to be open."
        },
        "south": {
          "to_room": 12044,
          "description": "The foyer is directly to the south."
        },
        "west": {
          "to_room": 12036,
          "description": "There is a large door to the west.",
          "door": {
            "name": "door",
            "state": "open",
            "locked": true,
            "key_vnum": 12035
          }
        }
      },
      "mob_resets": [
        {
          "vnum": 12004,
          "max": 3
        },
        {
          "vnum": 12013,
          "max": 2
        },
        {
          "vnum": 12023,
          "max": 1
        }
      ]
    },
    "12044": {
      "vnum": 12044,
      "name": "The Entrance Foyer",
      "description": "You have just entered the main government building of the Roman Empire\nand are standing in a massive room with an elaborately decorated domed\nroof. There are many people here; messengers and senators being the most\nnumerous. There is a large, ornate door to the west, a hallway leads\nnorth and marble stairs that lead out of the building are to the south.\nThe air is still and musty. The ceiling hangs low overhead.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12043,
          "description": "You see a hallway leading north to what looks like a waiting room."
        },
        "west": {
          "to_room": 12037,
          "description": "There is a large door to the west that blocks your path.",
          "door": {
            "name": "door",
            "state": "closed",
            "locked": false,
            "key_vnum": 12036
          }
        },
        "down": {
          "to_room": 12045,
          "description": "You see a stairway leading out of the building."
        }
      }
    },
    "12045": {
      "vnum": 12045,
      "name": "Outside The Capitol Building",
      "description": "The area opens on white marble steps that lead up and into the Capitol\nBuilding. There are several statues, none of any real significance, at\nthe entrance to the building. The main entrance to the building is at\nthe top of the steps. Vendors and pedestrians bustle past. The\ncobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "up": {
          "to_room": 12044,
          "description": "The steps lead into the Capitol Building."
        },
        "down": {
          "to_room": 12046,
          "description": "The steps terminate onto Clay Avenue."
        }
      },
      "extra_descs": {
        "": "statue statues"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        },
        {
          "vnum": 12019,
          "max": 3
        }
      ]
    },
    "12046": {
      "vnum": 12046,
      "name": "Clay Avenue",
      "description": "This area is a wide, heavily traveled road that runs east and west\nthrough the heart of the city. There are marble steps leading up. To the\nsouth, off in the distance, Visible is a large stone structure and a\nmountain that is partially obscured by the haze. There is a general\nstore to the north. The sounds of city life echo around. The smell of\nsmoke and humanity hangs in the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12063,
          "description": "The general store lies in that direction."
        },
        "east": {
          "to_room": 12051,
          "description": "There is what appears to be a large gate in that direction."
        },
        "west": {
          "to_room": 12039,
          "description": "Clay Avenue continues."
        },
        "up": {
          "to_room": 12045,
          "description": "There are some white marble steps leading up."
        }
      },
      "extra_descs": {
        "": "mountain"
      },
      "mob_resets": [
        {
          "vnum": 12017,
          "max": 15
        }
      ]
    },
    "12047": {
      "vnum": 12047,
      "name": "The Summit Of The Mountain Of The Gods",
      "description": "This is the summit of a very high mountain and are standing above the\nclouds. The sun is shining brilliantly here and the clouds below look\nlike balls of cotton. The path that you have been walking on is damp and\nthe scent of lilac is in the air. The air is thin and cold at this\naltitude. The wind howls around exposed peaks.",
      "sector_type": "mountain",
      "flags": [],
      "exits": {
        "down": {
          "to_room": 12052,
          "description": "You see a damp path leading back down the mountain."
        }
      },
      "mob_resets": [
        {
          "vnum": 12030,
          "max": 1
        }
      ]
    },
    "12049": {
      "vnum": 12049,
      "name": "Froboz's Workshop",
      "description": "This is the workshop of Froboz the Great, the most powerful and famous\nmage that Rome has ever known. Workbenches line the walls and are\ncovered with various test tubes, beakers, petri dishes and crucibles and\nthere is an odor in here that can best be described as a combination of\nold sweat socks and burning tires. The only exit is back through the\ndoor through which you came. In the middle of the room, you see a pile\nof ashes that looks like it once was a body and Froboz is is busy making\nadjustments on a new type of magic wand... possibly the one responsible\nfor the explosion a few minutes ago. He removes a jeweler's loupe from\nhis eye as he turns around. 'How in the name of Merlin did you get in\nhere??!!' he asks. 'Oh, nevermind! Since you are here, you can serve as\nwitnesses to the final test of the new mages' spell: \"ectowatt\".' With\nthis he makes a magical gesture and a paladin appears. Crossing his\nfingers, Froboz waves the wand his direction and what happens next is\nincredible! The Paladin is enveloped in what appears to be a small, well\ncontained, thermonuclear explosion. When the smoke clears Visible is\nthat the paladin and all of equipment has been reduced to a large pile\nof flaming cinders. Froboz throws his head back and cackles with insane\nglee. 'Now, my young friends, what can I do for you?', he asks. The air\nis still and musty. Dust motes drift in the stale air.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "west": {
          "to_room": 12042,
          "description": "There is a door, reinforced with steel, in that direction.",
          "door": {
            "name": "door",
            "state": "open",
            "locked": true,
            "key_vnum": 12038
          }
        }
      },
      "extra_descs": {
        "": "cinders ashes pile"
      },
      "mob_resets": [
        {
          "vnum": 12005,
          "max": 5
        },
        {
          "vnum": 12025,
          "max": 1
        }
      ]
    },
    "12050": {
      "vnum": 12050,
      "name": "The Courtroom",
      "description": "The area opens inside of a large courtroom in which common civil\ndisputes and criminal matters are decided. There is a judge's bench and\na witness stand on the far side of the room and a jury's box along side.\nThe Emperor's seal is prominently displayed on the wall behind the\njudge's stand, reminding all who enter that he is an extension of his\nhighness. There is a door, possibly leading to the judge's chambers, to\nthe east and the waiting room is to the west. Dust motes drift in the\nstale air. The ceiling hangs low overhead.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12055,
          "description": "The door might lead into the judge's private chambers.",
          "door": {
            "name": "door",
            "state": "closed",
            "locked": false,
            "key_vnum": 12039
          }
        },
        "south": {
          "to_room": 12060,
          "description": "The holding cells lie in that direction."
        },
        "west": {
          "to_room": 12043,
          "description": "The waiting room lies in that direction."
        }
      },
      "extra_descs": {
        "": "seal"
      },
      "mob_resets": [
        {
          "vnum": 12014,
          "max": 1
        },
        {
          "vnum": 12028,
          "max": 1
        },
        {
          "vnum": 12029,
          "max": 1
        }
      ]
    },
    "12051": {
      "vnum": 12051,
      "name": "The East Gate Of Rome",
      "description": "This isside of the eastern gate of Rome. There are two tall spires built\ninto the city wall, from which the guards can see the whole eastern side\nof the city. The gate is currently open and to the east, there is a\nheavily used road, made of packed clay, that leads out of Rome. Another\nroad leads westward into the city. The cobblestones are worn smooth by\ncountless feet. The smell of smoke and humanity hangs in the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "east": {
          "to_room": 12064,
          "description": "The clay road heads eastwards.",
          "door": {
            "name": "gate",
            "state": "closed",
            "locked": false,
            "key_vnum": null
          }
        },
        "west": {
          "to_room": 12046,
          "description": "The clay street leads into the city."
        }
      },
      "extra_descs": {
        "": "gate"
      },
      "mob_resets": [
        {
          "vnum": 12018,
          "max": 5
        },
        {
          "vnum": 12018,
          "max": 5
        }
      ]
    },
    "12052": {
      "vnum": 12052,
      "name": "A Mountain Path",
      "description": "The area opens on a small trail that leads up and down. It has recently\nbeen raining and there are small puddles everywhere. The area is just\nbelow the clouds and the view of the surrounding countryside is\nbreathtaking. The path is steep and treacherous. Bare rock dominates the\nlandscape.",
      "sector_type": "mountain",
      "flags": [],
      "exits": {
        "up": {
          "to_room": 12047,
          "description": "The trail leads up and enters the clouds."
        },
        "down": {
          "to_room": 12056,
          "description": "The trail leads down."
        }
      },
      "extra_descs": {
        "": "trail"
      },
      "mob_resets": [
        {
          "vnum": 12031,
          "max": 1
        }
      ]
    },
    "12055": {
      "vnum": 12055,
      "name": "The Judge's Chambers",
      "description": "This is a small room that is filled with legal tombs. There is a small\ndesk here, literally buried under legal documents. There is also a small\nwindow overlooking the northern part of the city. The walls are rough-\nhewn and cold to the touch. Dust motes drift in the stale air.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "west": {
          "to_room": 12050,
          "description": "The courtroom lies in that direction.",
          "door": {
            "name": "door",
            "state": "closed",
            "locked": false,
            "key_vnum": 12039
          }
        }
      },
      "extra_descs": {
        "": "papers documents"
      },
      "mob_resets": [
        {
          "vnum": 12022,
          "max": 1
        }
      ]
    },
    "12056": {
      "vnum": 12056,
      "name": "A Mountain Path",
      "description": "This area is a small trail that leads through a grove of trees. Every\nthing is lush and green here and it appears to have been raining\nrecently. 'This would be an ideal place for a picnic.' , you think to\nyourself. The path is steep and treacherous. Bare rock dominates the\nlandscape.",
      "sector_type": "mountain",
      "flags": [],
      "exits": {
        "up": {
          "to_room": 12052,
          "description": "You see a small trail leading further up the mountain."
        },
        "down": {
          "to_room": 12059,
          "description": "You see a small trail, leading down."
        }
      },
      "extra_descs": {
        "": "trail path"
      },
      "mob_resets": [
        {
          "vnum": 12032,
          "max": 1
        }
      ]
    },
    "12058": {
      "vnum": 12058,
      "name": "The Valley Of The Gods",
      "description": "The area opens in a tranquil valley at the base of a large mountain. A\nquiet stream, with fruit trees growing along its banks, winds its way\npeacefully through the valley and enters a large stone structure that\nlies to the west. There are birds singing and every now and then a\nripple breaks the surface of the stream. Visible is a path leading\nthrough the trees to the up. Sheep trails wind between the hillocks. The\nwind carries the scent of wild herbs.",
      "sector_type": "hills",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12057,
          "description": "A small path winds its way through the trees."
        },
        "up": {
          "to_room": 12059,
          "description": "You see a path leading up the mountain."
        }
      },
      "extra_descs": {
        "": "trees fruit"
      }
    },
    "12059": {
      "vnum": 12059,
      "name": "A Mountain Path",
      "description": "This area is a path that leads up through a stand of large trees.\nEverything is green and it seems like eternal spring - this is Mother\nNature at her finest. It is possible to descend into a tranquil valley\nfrom here. The wind howls around exposed peaks. Snow clings to shadowed\ncrevices.",
      "sector_type": "mountain",
      "flags": [],
      "exits": {
        "up": {
          "to_room": 12056,
          "description": "The path leads further up the mountain."
        },
        "down": {
          "to_room": 12058,
          "description": "The path widens out into a tranquil valley."
        }
      },
      "extra_descs": {
        "": "trees"
      },
      "mob_resets": [
        {
          "vnum": 12033,
          "max": 1
        }
      ]
    },
    "12060": {
      "vnum": 12060,
      "name": "The Holding Cells",
      "description": "This is the holding cell area, just off of the cortroom. Those who are\nrecently convicted of serious crimes are brought here, pending torture\nand execution. The courtroom lies to the north and another exit goes\neast. Dust motes drift in the stale air. The air is still and musty.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "north": {
          "to_room": 12050,
          "description": "The courtroom lies to the north."
        },
        "east": {
          "to_room": 12061,
          "description": ""
        }
      },
      "extra_descs": {
        "": "cells cell"
      }
    },
    "12061": {
      "vnum": 12061,
      "name": "The Torture Chamber",
      "description": "This is a very small room in which there are many tools designed\nspecifically for inflicting pain and suffering. Some of them are\nfamiliar, such as the rack and the iron maidens. Others, you have never\nseen before and they make you wonder about the kind of sadistic mind\nthat dreamt them up. The only exit is to the west. The air is still and\nmusty. The ceiling hangs low overhead.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "west": {
          "to_room": 12060,
          "description": "The holding cells lie in that direction."
        }
      },
      "mob_resets": [
        {
          "vnum": 12035,
          "max": 1
        }
      ]
    },
    "12062": {
      "vnum": 12062,
      "name": "The Roman Bakery",
      "description": "This is the bakery of Rome and your mouth waters at the delicious aromas\nwafting from the kitchen. The only exit is to the east. The walls are\nrough-hewn and cold to the touch. The air is still and musty.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12030,
          "description": ""
        }
      },
      "mob_resets": [
        {
          "vnum": 12036,
          "max": 1
        }
      ]
    },
    "12063": {
      "vnum": 12063,
      "name": "The General Store",
      "description": "This is the only general store of Rome. The walls and shelves are\ncovered with all of the various items required by Roman citizens and\nstalwart adventurers. Clay Avenue lies to the south. The ceiling hangs\nlow overhead. The air is still and musty.",
      "sector_type": "inside",
      "flags": [
        "indoors"
      ],
      "exits": {
        "south": {
          "to_room": 12046,
          "description": "Clay Avenue lies in that direction."
        }
      },
      "mob_resets": [
        {
          "vnum": 12037,
          "max": 1
        }
      ]
    },
    "12064": {
      "vnum": 12064,
      "name": "Before Rome",
      "description": "You travel upon an East-West road wide enough for 30 men to march\nabreast. It is packed hard through heavy use. To the west stands the\nGates of Rome inviting you to enter and partake of all the glory and\nsplendor that is Rome. The smell of smoke and humanity hangs in the air.\nBuildings crowd together on all sides.",
      "sector_type": "city",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12065,
          "description": ""
        },
        "west": {
          "to_room": 12051,
          "description": "",
          "door": {
            "name": "gate",
            "state": "closed",
            "locked": false,
            "key_vnum": null
          }
        }
      }
    },
    "12065": {
      "vnum": 12065,
      "name": "Clay Road",
      "description": "You travel upon an East-West road wide enough for 30 men to march\nabreast. It is packed hard through heavy use. To the west, your eyes\ncatch the splendors of a mighty city. Buildings crowd together on all\nsides. The sounds of city life echo around.",
      "sector_type": "city",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12066,
          "description": ""
        },
        "west": {
          "to_room": 12064,
          "description": ""
        }
      }
    },
    "12066": {
      "vnum": 12066,
      "name": "Clay Road",
      "description": "You travel upon an East-West road wide enough for 30 men to march\nabreast. The smell of smoke and humanity hangs in the air. The\ncobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12067,
          "description": ""
        },
        "west": {
          "to_room": 12065,
          "description": ""
        }
      }
    },
    "12067": {
      "vnum": 12067,
      "name": "The End Of The Clay Road",
      "description": "The mighty clay road turns into lesser, but still well traveled roads\nhere. You feel a surge run through your body as you look East into the\nlands that Rome turned into its mighty empire. The smell of smoke and\nhumanity hangs in the air. Vendors and pedestrians bustle past.",
      "sector_type": "city",
      "flags": [
        "indoors"
      ],
      "exits": {
        "east": {
          "to_room": 12068,
          "description": "A dirt trail leads towards the desert to the east."
        },
        "west": {
          "to_room": 12066,
          "description": "The mighty clay road leads off in this direction."
        }
      }
    },
    "12068": {
      "vnum": 12068,
      "name": "A Small Dirt Trail",
      "description": "This small dirt path seems to be a joint between a large clay road\nlocated a short distance to the west and the expanse of sand which opens\nup before to the east. The clay road appears to lead through the\nfoothills towards the snowcapped mountain chain to the west. Perhaps\nthere is a city or settlement in that direction. You cannot see any\nbreaks in the horizon of the sand which fills your vision as you look to\nthe east, it seems to stretch forever. The sounds of city life echo\naround. The cobblestones are worn smooth by countless feet.",
      "sector_type": "city",
      "flags": [
        "no_mob"
      ],
      "exits": {
        "east": {
          "to_room": 5028,
          "description": "The expanse of the Great Eastern Desert opens up before you."
        },
        "west": {
          "to_room": 12067,
          "description": "A large clay road begins a short distance to the west."
        }
      }
    },
    "12000": {
      "name": "The Coliseum Gates",
      "description": "Massive stone gates mark the entrance to the great Roman Coliseum. The roar of crowds can be heard from within, and the smell of sand and sweat fills the air.",
      "sector_type": "city",
      "flags": [],
      "exits": {},
      "mob_resets": [],
      "obj_resets": [],
      "vnum": 12000
    },
    "12011": {
      "name": "The Eastern Coliseum Corridor",
      "description": "A wide corridor runs along the eastern side of the Coliseum. Stone arches frame views of the arena below, where combatants test their mettle.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "west": {
          "to_room": 12004
        },
        "east": {
          "to_room": 12018
        }
      },
      "mob_resets": [],
      "obj_resets": [],
      "vnum": 12011
    },
    "12041": {
      "name": "Clay Avenue South",
      "description": "Clay Avenue continues southward here, the packed earth road lined with modest dwellings. Terracotta pots of herbs sit outside doorways.",
      "sector_type": "city",
      "flags": [],
      "exits": {
        "north": {
          "to_room": 12039
        }
      },
      "mob_resets": [],
      "obj_resets": [],
      "vnum": 12041
    },
    "12057": {
      "name": "The Valley Approach",
      "description": "The path winds northward toward the Valley of the Gods. Massive stone pillars, remnants of an ancient temple, line the way.",
      "sector_type": "hills",
      "flags": [],
      "exits": {
        "south": {
          "to_room": 12058
        }
      },
      "mob_resets": [],
      "obj_resets": [],
      "vnum": 12057
    }
  },
  "mobs": {
    "12000": {
      "vnum": 12000,
      "name": "judge",
      "short_desc": "the adjudicator",
      "long_desc": "An adjudicator is watching the games intently.",
      "level": 12,
      "alignment": 100,
      "hp_dice": "12d10+160",
      "damage_dice": "4d6+6",
      "gold": 7500,
      "exp": 720,
      "armor_class": 64,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "The adjudicator is a retired gladiator and scars cover all exposed parts of\nhis body.  Although he is getting on in years, he remains healthy and fit.",
      "equipment": {
        "wield": 3022,
        "shield": 3042
      }
    },
    "12001": {
      "vnum": 12001,
      "name": "scorekeeper",
      "short_desc": "the scorekeeper",
      "long_desc": "A scorekeeper has one eye on his stopwatch and the other on a clipboard.",
      "level": 7,
      "alignment": 100,
      "hp_dice": "7d10+100",
      "damage_dice": "2d5+6",
      "gold": 1375,
      "exp": 420,
      "armor_class": 79,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "The scorekeeper is a young man of about 25 years of age and is very intently\nstudying his clipboard.",
      "equipment": {
        "wield": 3021,
        "shield": 3042
      }
    },
    "12003": {
      "vnum": 12003,
      "name": "spectator",
      "short_desc": "the spectator",
      "long_desc": "A spectator is here watching the games.",
      "level": 5,
      "alignment": -100,
      "hp_dice": "5d10+76",
      "damage_dice": "2d5+3",
      "gold": 500,
      "exp": 300,
      "armor_class": 85,
      "flags": [
        "sentinel"
      ],
      "description": "The spectator is filthy, half drunk and screaming his head off."
    },
    "12004": {
      "vnum": 12004,
      "name": "noble",
      "short_desc": "the nobleman",
      "long_desc": "A nobleman stands here looking aloof.",
      "level": 12,
      "alignment": 500,
      "hp_dice": "12d10+160",
      "damage_dice": "4d6+6",
      "gold": 8250,
      "exp": 720,
      "armor_class": 64,
      "flags": [
        "sentinel",
        "wimpy",
        "memory"
      ],
      "description": "The nobleman is dressed in fine clothes and jewelry and has a very snobbish\nattitude.  While he is getting old and his hair and beard are streaked with\ngray, he is by no means an easy target.",
      "equipment": {
        "shield": 3042,
        "wield": 3022,
        "waist": 12001,
        "finger1": 12000
      },
      "inventory": [
        12033
      ]
    },
    "12005": {
      "vnum": 12005,
      "name": "slave",
      "short_desc": "the slave",
      "long_desc": "A slave stands here, wishing that she was free.",
      "level": 3,
      "alignment": 0,
      "hp_dice": "3d10+52",
      "damage_dice": "1d4+4",
      "gold": 180,
      "exp": 180,
      "armor_class": 91,
      "flags": [
        "sentinel"
      ],
      "description": "A very pretty young woman who was captured instead of being killed when\nthe Roman legions subjugated her land.",
      "equipment": {
        "wield": 3023
      }
    },
    "12006": {
      "vnum": 12006,
      "name": "gladiator",
      "short_desc": "the gladiator",
      "long_desc": "There is a gladiator standing here.",
      "level": 14,
      "alignment": -250,
      "hp_dice": "14d10+184",
      "damage_dice": "4d6+9",
      "gold": 10100,
      "exp": 840,
      "armor_class": 58,
      "flags": [
        "sentinel"
      ],
      "description": "A well muscled man who is very heavily armored and armed to the teeth.  He\nlives for combat.",
      "equipment": {
        "wield": 3022,
        "head": 12002
      }
    },
    "12007": {
      "vnum": 12007,
      "name": "driver",
      "short_desc": "the chariot driver",
      "long_desc": "There is a chariot driver here.",
      "level": 10,
      "alignment": 100,
      "hp_dice": "10d10+136",
      "damage_dice": "3d6+6",
      "gold": 5100,
      "exp": 600,
      "armor_class": 70,
      "flags": [
        "sentinel"
      ],
      "description": "You see a very slight and small individual whose whole life is centered around\nnothing but horses and speed.",
      "equipment": {
        "wield": 3021,
        "feet": 12008
      }
    },
    "12008": {
      "vnum": 12008,
      "name": "coach",
      "short_desc": "the coach",
      "long_desc": "There is a coach standing here, going over last minute strategy.",
      "level": 11,
      "alignment": 0,
      "hp_dice": "11d10+148",
      "damage_dice": "3d6+8",
      "gold": 5750,
      "exp": 660,
      "armor_class": 67,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "As you try to look over his shoulder and listen in on his mumbling,\nhe looks up at you and gives you a glare that chills you to the\nbone.",
      "equipment": {
        "wield": 3021,
        "body": 3043
      },
      "inventory": [
        12003
      ]
    },
    "12009": {
      "vnum": 12009,
      "name": "healer",
      "short_desc": "the healer",
      "long_desc": "A healer is standing here.",
      "level": 14,
      "alignment": 900,
      "hp_dice": "3d10+112",
      "damage_dice": "1d8+14",
      "gold": 9750,
      "exp": 463,
      "armor_class": 1,
      "flags": [
        "special",
        "sentinel",
        "aware",
        "memory"
      ],
      "description": "You see a young man, still learning about magical healing, wearing a white \ncoat and using a stethoscope.",
      "equipment": {
        "wield": 3022,
        "body": 3043,
        "shield": 3042,
        "neck1": 12004
      },
      "inventory": [
        12028
      ]
    },
    "12010": {
      "vnum": 12010,
      "name": "herbalist",
      "short_desc": "the herbalist",
      "long_desc": "There is a beautiful young lady here, standing here.",
      "level": 10,
      "alignment": 1000,
      "hp_dice": "2d8+50",
      "damage_dice": "1d6+8",
      "gold": 4250,
      "exp": 299,
      "armor_class": 2,
      "flags": [
        "sentinel",
        "wimpy",
        "memory"
      ],
      "description": "The herbalist is a very beautiful young lady who is about 22 years old.  She \nhas deep brown eyes and shoulder-length chestnut hair.  Her body is perfectly \nproportioned and she stands about 5' 5\" tall.",
      "equipment": {
        "wield": 3021,
        "body": 3043,
        "head": 12005
      },
      "inventory": [
        12027
      ]
    },
    "12011": {
      "vnum": 12011,
      "name": "shopkeeper",
      "short_desc": "Titus' shopkeeper",
      "long_desc": "Titus' shopkeeper is here, minding the store.",
      "level": 23,
      "alignment": 750,
      "hp_dice": "3d8+12",
      "damage_dice": "4d10+400",
      "gold": 42500,
      "exp": 8,
      "armor_class": -2,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "The shopkeeper is an older man in his middle to late fifties and looks like\nhe enjoys the quiet life.  There is a long scar running from the edge of his\nmouth to his right ear, making it look like he is always smiling.",
      "special": "shopkeeper",
      "shop_config": {
        "sells": [
          3020
        ],
        "buys": [
          "3023"
        ],
        "markup": 3021.0,
        "markdown": 3022.0
      },
      "inventory": [
        3020,
        3021,
        3022,
        3023,
        3024,
        3025,
        12008,
        12034
      ],
      "equipment": {
        "wield": 3022,
        "feet": 12008
      }
    },
    "12012": {
      "vnum": 12012,
      "name": "peddler",
      "short_desc": "the peddler",
      "long_desc": "A poor peddler is standing here, trying to support his meager existence.",
      "level": 4,
      "alignment": 250,
      "hp_dice": "1d8+0",
      "damage_dice": "1d4+1",
      "gold": 350,
      "exp": 8,
      "armor_class": 6,
      "flags": [
        "sentinel",
        "stay_zone",
        "wimpy",
        "no_charm"
      ],
      "description": "You see a small, dirty man who doesn't look very healthy.",
      "special": "shopkeeper",
      "shop_config": {
        "sells": [
          12006
        ],
        "buys": [
          "1.2"
        ],
        "markup": 12007.0,
        "markdown": -1.0
      },
      "equipment": {
        "feet": 12008
      },
      "inventory": [
        12006,
        12007
      ]
    },
    "12013": {
      "vnum": 12013,
      "name": "page",
      "short_desc": "the page",
      "long_desc": "A page stands here, waiting to run an errand.",
      "level": 6,
      "alignment": 0,
      "hp_dice": "6d10+88",
      "damage_dice": "2d5+5",
      "gold": 800,
      "exp": 360,
      "armor_class": 82,
      "flags": [
        "sentinel"
      ],
      "description": "You see a young boy who looks very strong and very fast.  He has the look of\na scholar about him.",
      "equipment": {
        "wield": 3020,
        "feet": 12008
      }
    },
    "12014": {
      "vnum": 12014,
      "name": "plaintiff",
      "short_desc": "the plaintiff",
      "long_desc": "The plaintiff stands here, pleading his case.",
      "level": 11,
      "alignment": 0,
      "hp_dice": "11d10+148",
      "damage_dice": "3d6+8",
      "gold": 6500,
      "exp": 660,
      "armor_class": 67,
      "flags": [
        "sentinel"
      ],
      "description": "He looks pitiful.  Absolutely pitiful.",
      "equipment": {
        "wield": 3022,
        "wrist2": 12011
      }
    },
    "12015": {
      "vnum": 12015,
      "name": "master",
      "short_desc": "the ticket master",
      "long_desc": "A ticket master is here, looking at you expectantly.",
      "level": 17,
      "alignment": 100,
      "hp_dice": "17d10+220",
      "damage_dice": "5d7+7",
      "gold": 16000,
      "exp": 1020,
      "armor_class": 49,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "He seems to be waiting for you to either buy a ticket or to get out\nof his way so that he can sell tickets to people that actually want\nthem.",
      "equipment": {
        "wield": 12015
      }
    },
    "12016": {
      "vnum": 12016,
      "name": "vendor",
      "short_desc": "the stadium vendor",
      "long_desc": "A stadium vendor is walking here, selling overpriced hotdogs and beer.",
      "level": 8,
      "alignment": -150,
      "hp_dice": "2d5+15",
      "damage_dice": "1d4+1",
      "gold": 2100,
      "exp": 8,
      "armor_class": 3,
      "flags": [
        "stay_zone"
      ],
      "description": "The vendor is a scruffy looking man who isn't afraid of a fight and looks\nlike he has had just about enough of smart-mouthed spectators.",
      "special": "shopkeeper",
      "shop_config": {
        "sells": [],
        "buys": [],
        "markup": 1.6,
        "markdown": 0.3
      },
      "inventory": [
        12010,
        12010,
        12010
      ]
    },
    "12017": {
      "vnum": 12017,
      "name": "citizen",
      "short_desc": "the citizen",
      "long_desc": "A citizen of Rome is standing here.",
      "level": 5,
      "alignment": 900,
      "hp_dice": "1d8+1",
      "damage_dice": "1d4+2",
      "gold": 550,
      "exp": 121,
      "armor_class": 5,
      "flags": [
        "stay_zone",
        "memory"
      ],
      "description": "It appears to be your ordinary citizen going about his business."
    },
    "12018": {
      "vnum": 12018,
      "name": "gateguard",
      "short_desc": "the gateguard",
      "long_desc": "A gateguard stands here, tending the gate.",
      "level": 11,
      "alignment": 1000,
      "hp_dice": "3d10+88",
      "damage_dice": "1d8+11",
      "gold": 5750,
      "exp": 338,
      "armor_class": 2,
      "flags": [
        "special",
        "sentinel",
        "scavenger",
        "aware",
        "memory"
      ],
      "description": "You see a strong, loyal public defender.",
      "equipment": {
        "wield": 3022
      }
    },
    "12019": {
      "vnum": 12019,
      "name": "soldier",
      "short_desc": "the soldier",
      "long_desc": "A soldier on leave is walking around looking for entertainment.",
      "level": 17,
      "alignment": 300,
      "hp_dice": "17d10+220",
      "damage_dice": "5d7+7",
      "gold": 14640,
      "exp": 1020,
      "armor_class": 49,
      "flags": [
        "stay_zone",
        "memory"
      ],
      "description": "You see a member of one of the Emperor's elite legions.  He looks VERY strong.\nYou have this vague feeling that his entertainment isn't going to be a very\nwholesome activity.",
      "equipment": {
        "wield": 3021,
        "feet": 12008,
        "body": 12018
      }
    },
    "12020": {
      "vnum": 12020,
      "name": "emperor",
      "short_desc": "Julius Caesar",
      "long_desc": "Julius Caesar, the Emperor of Rome, is sitting here.",
      "level": 27,
      "alignment": 990,
      "hp_dice": "6d10+675",
      "damage_dice": "3d6+48",
      "gold": 87381,
      "exp": 1088,
      "armor_class": -7,
      "flags": [
        "special",
        "sentinel",
        "memory"
      ],
      "description": "You see a man who is dressed in the finest of clothes, has eaten the best of\nfoods and lived in the most opulent palace that Rome has ever known.",
      "equipment": {
        "wield": 3022,
        "arms": 12017
      },
      "inventory": [
        12024
      ]
    },
    "12021": {
      "vnum": 12021,
      "name": "guard",
      "short_desc": "the royal bodyguard",
      "long_desc": "There is a royal bodyguard here, ready to die for the Emperor, if necessary.",
      "level": 18,
      "alignment": 990,
      "hp_dice": "4d10+216",
      "damage_dice": "2d6+21",
      "gold": 20000,
      "exp": 642,
      "armor_class": 0,
      "flags": [
        "special",
        "sentinel",
        "aggr_evil",
        "aggr_neutral",
        "memory"
      ],
      "description": "The bodyguard is dressed in the finest of armor and wields only the\ndeadliest of weapons.  He is very strong and would put up one hell\nof a fight.  He has been trained to be suspicious of all but the\nmost innocent visitors, and likely to take offense of anyone with\nless than pure intentions.",
      "equipment": {
        "wield": 3022,
        "shield": 3042,
        "body": 3046
      }
    },
    "12022": {
      "vnum": 12022,
      "name": "judge",
      "short_desc": "the judge",
      "long_desc": "A judge is standing here, reading a case.",
      "level": 21,
      "alignment": 990,
      "hp_dice": "5d10+378",
      "damage_dice": "2d8+31",
      "gold": 27500,
      "exp": 785,
      "armor_class": -1,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "He seems to be quite interested in the case, perhaps you shouldn't\ndisturb him now, later would probably be a better time.",
      "equipment": {
        "wield": 3022,
        "finger2": 12012
      }
    },
    "12023": {
      "vnum": 12023,
      "name": "master",
      "short_desc": "the master scheduler",
      "long_desc": "The master scheduler is here, writing in an appointment book.",
      "level": 17,
      "alignment": 900,
      "hp_dice": "4d10+204",
      "damage_dice": "2d6+20",
      "gold": 15500,
      "exp": 596,
      "armor_class": 0,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "As you look at him, he looks up at you and asks, 'Do you have an\nappointment?'  He waits for a few seconds and then asks, 'Would\nyou like one?'",
      "equipment": {
        "wield": 3022,
        "feet": 12008,
        "neck2": 12013
      },
      "inventory": [
        12035,
        12036
      ]
    },
    "12024": {
      "vnum": 12024,
      "name": "slimeball",
      "short_desc": "the slimeball",
      "long_desc": "A green ball of slime is hanging over you, oozing downward.",
      "level": 12,
      "alignment": -500,
      "hp_dice": "12d10+160",
      "damage_dice": "4d6+6",
      "gold": 6500,
      "exp": 720,
      "armor_class": 64,
      "flags": [
        "sentinel",
        "scavenger",
        "aggressive",
        "no_bash",
        "no_blind"
      ],
      "description": "There is a green 'ball' of slime oozing from the coating on the walls.",
      "inventory": [
        12030
      ]
    },
    "12025": {
      "vnum": 12025,
      "name": "froboz",
      "short_desc": "Froboz",
      "long_desc": "Froboz the wizard is standing here, working on a new spell.",
      "level": 23,
      "alignment": 300,
      "hp_dice": "23d10+292",
      "damage_dice": "6d8+9",
      "gold": 63500,
      "exp": 1380,
      "armor_class": 31,
      "flags": [
        "special",
        "sentinel",
        "aware",
        "memory",
        "no_charm",
        "no_summmon"
      ],
      "description": "You see a middle-aged man whose knowledge of magic, both offensive and \ndefensive, is legendary.  He literally glows with a pink aura.",
      "equipment": {
        "wield": 3022,
        "shield": 3042,
        "about": 12014
      },
      "inventory": [
        12025,
        12026,
        12029
      ]
    },
    "12026": {
      "vnum": 12026,
      "name": "titus",
      "short_desc": "Titus Andronicus",
      "long_desc": "Titus Andronicus is standing here, polishing a few swords.",
      "level": 24,
      "alignment": 500,
      "hp_dice": "24d10+304",
      "damage_dice": "7d8+6",
      "gold": 58000,
      "exp": 1440,
      "armor_class": 28,
      "flags": [
        "sentinel",
        "aware",
        "aggressive",
        "memory",
        "no_charm",
        "no_summmon"
      ],
      "description": "As you look at him, he suddenly swings a newly sharpened sword\nat you!  Watch out!",
      "equipment": {
        "hold": 12016,
        "wield": 3022,
        "shield": 3042,
        "body": 3046,
        "feet": 12008
      }
    },
    "12027": {
      "vnum": 12027,
      "name": "senator",
      "short_desc": "the senator",
      "long_desc": "A senator is here, waiting for debate to begin.",
      "level": 10,
      "alignment": 350,
      "hp_dice": "10d10+136",
      "damage_dice": "3d6+6",
      "gold": 4750,
      "exp": 600,
      "armor_class": 70,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "He seems to be quite bored and is playing with the edge of his toga.",
      "equipment": {
        "wield": 3021,
        "body": 3044
      },
      "inventory": [
        12037,
        3050
      ]
    },
    "12028": {
      "vnum": 12028,
      "name": "bailiff",
      "short_desc": "the bailiff",
      "long_desc": "The bailiff stands here, keeping order in the courtroom.",
      "level": 16,
      "alignment": 900,
      "hp_dice": "4d10+192",
      "damage_dice": "2d6+19",
      "gold": 12500,
      "exp": 551,
      "armor_class": 1,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "He is a very stern man and insists on absolute quiet in his courtroom\nunless the judge has given someone permisson to speak.",
      "equipment": {
        "wield": 3022,
        "shield": 3042
      },
      "inventory": [
        12039
      ]
    },
    "12029": {
      "vnum": 12029,
      "name": "defendant",
      "short_desc": "the defendant",
      "long_desc": "The defendant stands here, pleading her case.",
      "level": 11,
      "alignment": 200,
      "hp_dice": "11d10+148",
      "damage_dice": "3d6+8",
      "gold": 5750,
      "exp": 660,
      "armor_class": 67,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "She looks to be well organized and full of confidence.",
      "equipment": {
        "wield": 3024,
        "body": 3043
      }
    },
    "12030": {
      "vnum": 12030,
      "name": "jupiter",
      "short_desc": "Jupiter",
      "long_desc": "Jupiter, King of the Gods, is watching over his realm here.",
      "level": 34,
      "alignment": 1000,
      "hp_dice": "8d10+1190",
      "damage_dice": "3d8+68",
      "gold": 15000,
      "exp": 1468,
      "armor_class": -10,
      "flags": [
        "special",
        "sentinel",
        "aware",
        "aggr_evil",
        "memory",
        "no_charm",
        "no_summmon",
        "no_sleep",
        "no_bash",
        "no_blind"
      ],
      "description": "He is the strongest of the Gods, and certainly no easy mark!  His powers\ntranscend the plane of the physical, and could easily kill an unprepared\nmortal.",
      "equipment": {
        "wield": 12020
      },
      "loot_table": [
        {
          "vnum": 12040,
          "chance": 20
        },
        {
          "vnum": 12041,
          "chance": 20
        },
        {
          "vnum": 12042,
          "chance": 20
        },
        {
          "vnum": 12043,
          "chance": 20
        },
        {
          "vnum": 12044,
          "chance": 20
        },
        {
          "vnum": 12045,
          "chance": 20
        },
        {
          "vnum": 12046,
          "chance": 20
        },
        {
          "vnum": 12047,
          "chance": 20
        },
        {
          "vnum": 12048,
          "chance": 20
        }
      ],
      "loot_chance": 100
    },
    "12031": {
      "vnum": 12031,
      "name": "venus",
      "short_desc": "Venus",
      "long_desc": "Venus, the Goddess of Beauty and Knowledge, is resting here.",
      "level": 28,
      "alignment": 1000,
      "hp_dice": "6d10+700",
      "damage_dice": "3d6+50",
      "gold": 11000,
      "exp": 1141,
      "armor_class": -6,
      "flags": [
        "special",
        "sentinel",
        "aware",
        "memory",
        "no_charm",
        "no_summmon",
        "no_sleep",
        "no_bash",
        "no_blind"
      ],
      "description": "Venus is probably one of the most beautiful women you have ever seen\nif not THE most beautiful.  She is very powerful and tough under that\nouter image of beauty.",
      "equipment": {
        "neck1": 12022
      }
    },
    "12032": {
      "vnum": 12032,
      "name": "mars",
      "short_desc": "Mars",
      "long_desc": "Mars, the God of War and State, is sitting down here.",
      "level": 27,
      "alignment": 1000,
      "hp_dice": "6d10+675",
      "damage_dice": "3d6+48",
      "gold": 11000,
      "exp": 1088,
      "armor_class": -9,
      "flags": [
        "special",
        "sentinel",
        "aware",
        "memory",
        "no_charm",
        "no_summmon",
        "no_sleep",
        "no_bash",
        "no_blind"
      ],
      "description": "Mars is a tall God with burning, hateful eyes and a large scowl on\nhis face.",
      "equipment": {
        "hold": 12016,
        "waist": 12021
      }
    },
    "12033": {
      "vnum": 12033,
      "name": "mercury",
      "short_desc": "Mercury",
      "long_desc": "Mercury, the messenger of the Gods, is standing here.",
      "level": 26,
      "alignment": 1000,
      "hp_dice": "6d10+650",
      "damage_dice": "3d6+46",
      "gold": 90000,
      "exp": 1036,
      "armor_class": -10,
      "flags": [
        "sentinel",
        "aware",
        "memory",
        "no_charm",
        "no_summmon",
        "no_sleep",
        "no_bash",
        "no_blind"
      ],
      "description": "Mercury is a handsome, youthful God and wears a large grin on his face.",
      "equipment": {
        "feet": 12023
      }
    },
    "12034": {
      "vnum": 12034,
      "name": "shopkeeper",
      "short_desc": "Froboz' shopkeeper",
      "long_desc": "Froboz' shopkeeper is here, minding the store.",
      "level": 23,
      "alignment": 650,
      "hp_dice": "1d8+14",
      "damage_dice": "4d10+400",
      "gold": 42500,
      "exp": 8,
      "armor_class": -2,
      "flags": [
        "sentinel",
        "memory",
        "no_charm",
        "no_summmon"
      ],
      "description": "The shopkeeper is an older man in his middle to late fifties and looks like\nhe enjoys the quiet life.  There is a long scar running from the edge of his\nmouth to his right ear, making it look like he is always smiling.",
      "special": "shopkeeper",
      "shop_config": {
        "sells": [
          3050
        ],
        "buys": [
          "3053"
        ],
        "markup": 3051.0,
        "markdown": 3052.0
      },
      "inventory": [
        3050,
        3051,
        3052,
        3053,
        3054,
        12030,
        12038
      ],
      "equipment": {
        "wield": 3022,
        "feet": 12008
      }
    },
    "12035": {
      "vnum": 12035,
      "name": "executioner",
      "short_desc": "the executioner",
      "long_desc": "The executioner stands here, waiting to torture some sorry soul.",
      "level": 20,
      "alignment": -1000,
      "hp_dice": "20d10+256",
      "damage_dice": "6d8+5",
      "gold": 20500,
      "exp": 1200,
      "armor_class": 40,
      "flags": [
        "sentinel",
        "scavenger",
        "aggressive",
        "no_charm",
        "no_summmon"
      ],
      "description": "You see a burly man who is wearing a black hood that obscures his face.  He\nhas a very sadistic attitude and clearly loves his work.",
      "inventory": [
        12031
      ]
    },
    "12036": {
      "vnum": 12036,
      "name": "baker",
      "short_desc": "the baker",
      "long_desc": "The baker looks at you calmly, wiping flour from his face with one hand.",
      "level": 33,
      "alignment": 900,
      "hp_dice": "2d8+22",
      "damage_dice": "6d10+30000",
      "gold": 41000,
      "exp": 8,
      "armor_class": -10,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "A fat, nice looking baker.  But you can see that he has many scars on his\nbody.",
      "special": "shopkeeper",
      "shop_config": {
        "sells": [
          3000,
          3101
        ],
        "buys": [
          "3010"
        ],
        "markup": 3001.0,
        "markdown": 3009.0
      },
      "inventory": [
        3000,
        3001,
        3009,
        3010,
        3011,
        3101,
        12006,
        12007
      ],
      "equipment": {
        "wield": 3022
      },
      "loot_table": [
        {
          "vnum": 12040,
          "chance": 20
        },
        {
          "vnum": 12041,
          "chance": 20
        },
        {
          "vnum": 12042,
          "chance": 20
        },
        {
          "vnum": 12043,
          "chance": 20
        },
        {
          "vnum": 12044,
          "chance": 20
        },
        {
          "vnum": 12045,
          "chance": 20
        },
        {
          "vnum": 12046,
          "chance": 20
        },
        {
          "vnum": 12047,
          "chance": 20
        },
        {
          "vnum": 12048,
          "chance": 20
        }
      ],
      "loot_chance": 100
    },
    "12037": {
      "vnum": 12037,
      "name": "grocer",
      "short_desc": "the grocer",
      "long_desc": "A grocer stands at the counter, with a slightly impatient look on his face.",
      "level": 33,
      "alignment": 900,
      "hp_dice": "2d8+22",
      "damage_dice": "1d1+30000",
      "gold": 50000,
      "exp": 8,
      "armor_class": -10,
      "flags": [
        "sentinel",
        "memory"
      ],
      "description": "A tall grocer, who moves two 200 pounds bag of flour around on his shoulders.",
      "special": "shopkeeper",
      "shop_config": {
        "sells": [
          3030,
          3102
        ],
        "buys": [
          "3033"
        ],
        "markup": 3031.0,
        "markdown": 3032.0
      },
      "inventory": [
        3030,
        3031,
        3032,
        3033,
        3036,
        3102,
        12003
      ],
      "equipment": {
        "wield": 3022
      },
      "loot_table": [
        {
          "vnum": 12040,
          "chance": 20
        },
        {
          "vnum": 12041,
          "chance": 20
        },
        {
          "vnum": 12042,
          "chance": 20
        },
        {
          "vnum": 12043,
          "chance": 20
        },
        {
          "vnum": 12044,
          "chance": 20
        },
        {
          "vnum": 12045,
          "chance": 20
        },
        {
          "vnum": 12046,
          "chance": 20
        },
        {
          "vnum": 12047,
          "chance": 20
        },
        {
          "vnum": 12048,
          "chance": 20
        }
      ],
      "loot_chance": 100
    }
  },
  "objects": {
    "12000": {
      "vnum": 12000,
      "name": "ring",
      "short_desc": "a pewter ring",
      "room_desc": "There is a pewter ring lying here.",
      "item_type": "treasure",
      "weight": 5,
      "value": 15000
    },
    "12001": {
      "vnum": 12001,
      "name": "belt",
      "short_desc": "a bronze belt",
      "room_desc": "There is a bronze belt on the ground here.",
      "item_type": "armor",
      "weight": 5,
      "value": 10000,
      "armor_bonus": 4
    },
    "12002": {
      "vnum": 12002,
      "name": "helmet",
      "short_desc": "a Roman combat helmet",
      "room_desc": "A Roman combat helmet has been left here.",
      "item_type": "armor",
      "weight": 25,
      "value": 12000,
      "armor_bonus": 8
    },
    "12003": {
      "vnum": 12003,
      "name": "whistle",
      "short_desc": "a coach's whistle",
      "room_desc": "A coach's whistle has been left here.",
      "item_type": "treasure",
      "weight": 1,
      "value": 1000
    },
    "12004": {
      "vnum": 12004,
      "name": "stethoscope",
      "short_desc": "a stethoscope",
      "room_desc": "There is an odd object laying on the ground here.",
      "item_type": "treasure",
      "weight": 1,
      "value": 15000
    },
    "12005": {
      "vnum": 12005,
      "name": "hairpin",
      "short_desc": "a hairpin",
      "room_desc": "A woman's hairpin is lying here.",
      "item_type": "treasure",
      "weight": 1,
      "value": 3000
    },
    "12006": {
      "vnum": 12006,
      "name": "apple",
      "short_desc": "an apple",
      "room_desc": "A delicious looking apple has been left here.",
      "item_type": "food",
      "weight": 1,
      "value": 5,
      "nutrition": 4
    },
    "12007": {
      "vnum": 12007,
      "name": "orange",
      "short_desc": "an orange",
      "room_desc": "A sun-ripened orange has been left here.",
      "item_type": "food",
      "weight": 1,
      "value": 6,
      "nutrition": 6
    },
    "12008": {
      "vnum": 12008,
      "name": "sandals",
      "short_desc": "a pair of leather sandals",
      "room_desc": "A pair of leather sandals has been dropped here.",
      "item_type": "armor",
      "weight": 2,
      "value": 250,
      "armor_bonus": 2
    },
    "12010": {
      "vnum": 12010,
      "name": "hotdog",
      "short_desc": "a hotdog",
      "room_desc": "A hotdog loaded with chili and onions has been left here.",
      "item_type": "food",
      "weight": 1,
      "value": 11,
      "nutrition": 8
    },
    "12011": {
      "vnum": 12011,
      "name": "bracelet",
      "short_desc": "a silver and gold bracelet",
      "room_desc": "A bracelet, made from silver and gold, has been carelessly left here.",
      "item_type": "treasure",
      "weight": 14,
      "value": 10000
    },
    "12012": {
      "vnum": 12012,
      "name": "ring",
      "short_desc": "a sapphire ring",
      "room_desc": "A sapphire ring has been left here.",
      "item_type": "treasure",
      "weight": 20,
      "value": 35000
    },
    "12013": {
      "vnum": 12013,
      "name": "pendant",
      "short_desc": "a jade pendant",
      "room_desc": "A beautiful jade pendant has been left here.",
      "item_type": "treasure",
      "weight": 30,
      "value": 16500
    },
    "12014": {
      "vnum": 12014,
      "name": "robe",
      "short_desc": "Froboz' robe",
      "room_desc": "Froboz' robe has been dropped here.",
      "item_type": "treasure",
      "weight": 5,
      "value": 15000
    },
    "12015": {
      "vnum": 12015,
      "name": "sword",
      "short_desc": "a tempered sword",
      "room_desc": "A nasty looking tempered sword is lying here.",
      "item_type": "weapon",
      "weight": 16,
      "value": 15000,
      "damage_dice": "3d8",
      "weapon_type": "slash"
    },
    "12016": {
      "vnum": 12016,
      "name": "sword",
      "short_desc": "a quenched sword",
      "room_desc": "A very bloody, but quenched, sword has been left here.",
      "item_type": "weapon",
      "weight": 14,
      "value": 10000,
      "damage_dice": "3d5",
      "weapon_type": "slash"
    },
    "12017": {
      "vnum": 12017,
      "name": "bracers",
      "short_desc": "a pair of Moorish bracers",
      "room_desc": "A pair of Moorish bracers has been dropped here.",
      "item_type": "armor",
      "weight": 15,
      "value": 25000,
      "armor_bonus": 8
    },
    "12018": {
      "vnum": 12018,
      "name": "plate",
      "short_desc": "a Roman combat breast plate",
      "room_desc": "A piece of military combat plate has been left here.",
      "item_type": "armor",
      "weight": 135,
      "value": 50000,
      "armor_bonus": 8
    },
    "12019": {
      "vnum": 12019,
      "name": "boots",
      "short_desc": "a pair of Roman combat boots",
      "room_desc": "A pair of combat boots have been left here.",
      "item_type": "armor",
      "weight": 45,
      "value": 8750,
      "armor_bonus": 8
    },
    "12020": {
      "vnum": 12020,
      "name": "thunderbolt",
      "short_desc": "Jupiter's Thunderbolt",
      "room_desc": "Jupiter's Thunderbolt has been left here.",
      "item_type": "weapon",
      "weight": 22,
      "value": 100000,
      "damage_dice": "4d6",
      "weapon_type": "crush"
    },
    "12021": {
      "vnum": 12021,
      "name": "loincloth",
      "short_desc": "a red loincloth",
      "room_desc": "Mars' red loincloth is resting here.",
      "item_type": "armor",
      "weight": 30,
      "value": 100000,
      "armor_bonus": 15
    },
    "12022": {
      "vnum": 12022,
      "name": "necklace",
      "short_desc": "a crystal necklace",
      "room_desc": "Someone has left the crystal necklace of knowledge here.",
      "item_type": "treasure",
      "weight": 35,
      "value": 50000
    },
    "12023": {
      "vnum": 12023,
      "name": "sandals",
      "short_desc": "a pair of winged sandals",
      "room_desc": "Mercury's winged sandals have been left here.",
      "item_type": "armor",
      "weight": 14,
      "value": 75000,
      "armor_bonus": 8
    },
    "12024": {
      "vnum": 12024,
      "name": "scroll",
      "short_desc": "a dark grey scroll",
      "room_desc": "A scroll has been carelessly left here.",
      "item_type": "scroll",
      "weight": 2,
      "value": 5000
    },
    "12025": {
      "vnum": 12025,
      "name": "scroll",
      "short_desc": "an ornate scroll",
      "room_desc": "An ornate scroll has been left here.",
      "item_type": "scroll",
      "weight": 2,
      "value": 7000
    },
    "12026": {
      "vnum": 12026,
      "name": "scroll",
      "short_desc": "a plain scroll",
      "room_desc": "A plain scroll is lying on the ground.",
      "item_type": "scroll",
      "weight": 2,
      "value": 8000
    },
    "12027": {
      "vnum": 12027,
      "name": "bag",
      "short_desc": "a bag of herbs",
      "room_desc": "There is a small, sweet-smelling bag here on the ground.",
      "item_type": "wand",
      "weight": 5,
      "value": 15000
    },
    "12028": {
      "vnum": 12028,
      "name": "staff",
      "short_desc": "a Kodarta staff",
      "room_desc": "A Kodarta staff has been carelessly left here.",
      "item_type": "staff",
      "weight": 6,
      "value": 35000
    },
    "12029": {
      "vnum": 12029,
      "name": "wand",
      "short_desc": "a prototype wand",
      "room_desc": "There is a prototype of a new magical wand lying here.",
      "item_type": "wand",
      "weight": 26,
      "value": 20000
    },
    "12030": {
      "vnum": 12030,
      "name": "flask",
      "short_desc": "a flask",
      "room_desc": "There is a flask, containing a blaze orange potion, resting here.",
      "item_type": "potion",
      "weight": 8,
      "value": 1000
    },
    "12031": {
      "vnum": 12031,
      "name": "mace",
      "short_desc": "an executioner's mace",
      "room_desc": "An executioner's mace is lying here.",
      "item_type": "weapon",
      "weight": 13,
      "value": 3000,
      "damage_dice": "5d1",
      "weapon_type": "pound"
    },
    "12032": {
      "vnum": 12032,
      "name": "mug",
      "short_desc": "a mug",
      "room_desc": "A frosty mug has been left on the ground here.",
      "item_type": "drinkcon",
      "weight": 3,
      "value": 10,
      "capacity": 3,
      "current": 3
    },
    "12033": {
      "vnum": 12033,
      "name": "key",
      "short_desc": "a rusted key",
      "room_desc": "There is a rusted key here.",
      "item_type": "key",
      "weight": 1,
      "value": 0
    },
    "12034": {
      "vnum": 12034,
      "name": "key",
      "short_desc": "a double sided key",
      "room_desc": "A double sided key has been left here.",
      "item_type": "key",
      "weight": 10,
      "value": 0
    },
    "12035": {
      "vnum": 12035,
      "name": "key",
      "short_desc": "a diamond studded key",
      "room_desc": "A diamond studded key is sitting on the ground.",
      "item_type": "key",
      "weight": 30,
      "value": 0
    },
    "12036": {
      "vnum": 12036,
      "name": "key",
      "short_desc": "a key with a pearl handle",
      "room_desc": "A key with a pearl handle is sitting on the ground.",
      "item_type": "key",
      "weight": 10,
      "value": 0
    },
    "12037": {
      "vnum": 12037,
      "name": "key",
      "short_desc": "an aquamarine key",
      "room_desc": "There is an aquamarine colored key here.",
      "item_type": "key",
      "weight": 10,
      "value": 0
    },
    "12038": {
      "vnum": 12038,
      "name": "key",
      "short_desc": "an opal key",
      "room_desc": "An opal key has been left here.",
      "item_type": "key",
      "weight": 20,
      "value": 0
    },
    "12039": {
      "vnum": 12039,
      "name": "key",
      "short_desc": "a steel key",
      "room_desc": "A steel key is lying on the ground.",
      "item_type": "key",
      "weight": 1,
      "value": 0
    },
    "12040": {
      "vnum": 12040,
      "name": "imperial gladius",
      "short_desc": "\u001b[93man imperial \u001b[91mgladius\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mAn imperial \u001b[91mgladius\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A legionary sword.",
      "item_type": "weapon",
      "weight": 5,
      "value": 8000,
      "wear_slot": "wield",
      "weapon_type": "slash",
      "damage_dice": "2d6+5",
      "affects": [
        {
          "type": "damroll",
          "value": 3
        }
      ],
      "set_id": 120
    },
    "12041": {
      "vnum": 12041,
      "name": "legionary shield",
      "short_desc": "\u001b[93ma legionary \u001b[93mshield\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mA legionary \u001b[93mshield\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A paladin's shield.",
      "item_type": "armor",
      "weight": 5,
      "value": 8000,
      "wear_slot": "shield",
      "armor_bonus": 3,
      "affects": [
        {
          "type": "cha",
          "value": 1
        }
      ],
      "set_id": 120
    },
    "12042": {
      "vnum": 12042,
      "name": "crimson sigil",
      "short_desc": "\u001b[93ma crimson \u001b[35msigil\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mA crimson \u001b[35msigil\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A deathknight's sigil.",
      "item_type": "armor",
      "weight": 5,
      "value": 8000,
      "wear_slot": "neck1",
      "affects": [
        {
          "type": "damroll",
          "value": 4
        }
      ],
      "set_id": 120
    },
    "12043": {
      "vnum": 12043,
      "name": "censer of the twelve",
      "short_desc": "\u001b[93ma \u001b[93mcenser\u001b[0m\u001b[93m of the twelve\u001b[0m",
      "room_desc": "\u001b[93mA \u001b[93mcenser\u001b[0m\u001b[93m of the twelve lies here.\u001b[0m",
      "description": "A cleric's censer.",
      "item_type": "armor",
      "weight": 5,
      "value": 8000,
      "wear_slot": "hold",
      "affects": [
        {
          "type": "wis",
          "value": 3
        },
        {
          "type": "max_mana",
          "value": 35
        }
      ],
      "set_id": 120
    },
    "12044": {
      "vnum": 12044,
      "name": "oracle's focus",
      "short_desc": "\u001b[93man oracle's \u001b[96mfocus\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mAn oracle's \u001b[96mfocus\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A mage's focus.",
      "item_type": "armor",
      "weight": 5,
      "value": 8000,
      "wear_slot": "hold",
      "affects": [
        {
          "type": "int",
          "value": 3
        }
      ],
      "set_id": 120
    },
    "12045": {
      "vnum": 12045,
      "name": "laureate lyre",
      "short_desc": "\u001b[93ma laureate \u001b[95mlyre\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mA laureate \u001b[95mlyre\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A bard's lyre.",
      "item_type": "weapon",
      "weight": 5,
      "value": 8000,
      "wear_slot": "wield",
      "weapon_type": "mace",
      "damage_dice": "1d6+2",
      "affects": [
        {
          "type": "cha",
          "value": 3
        }
      ],
      "set_id": 120
    },
    "12046": {
      "vnum": 12046,
      "name": "senate dagger",
      "short_desc": "\u001b[93ma senate \u001b[92mdagger\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mA senate \u001b[92mdagger\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A rogue's dagger.",
      "item_type": "weapon",
      "weight": 5,
      "value": 8000,
      "wear_slot": "wield",
      "weapon_type": "pierce",
      "damage_dice": "1d6+3",
      "affects": [
        {
          "type": "dex",
          "value": 3
        },
        {
          "type": "hitroll",
          "value": 1
        }
      ],
      "set_id": 120
    },
    "12047": {
      "vnum": 12047,
      "name": "scout's band",
      "short_desc": "\u001b[93ma scout's \u001b[92mband\u001b[0m\u001b[93m\u001b[0m",
      "room_desc": "\u001b[93mA scout's \u001b[92mband\u001b[0m\u001b[93m lies here.\u001b[0m",
      "description": "A ranger's ring.",
      "item_type": "armor",
      "weight": 5,
      "value": 8000,
      "wear_slot": "finger1",
      "affects": [
        {
          "type": "dex",
          "value": 2
        },
        {
          "type": "hitroll",
          "value": 1
        }
      ],
      "set_id": 120
    },
    "12048": {
      "vnum": 12048,
      "name": "imperial mantle",
      "short_desc": "\u001b[93man imperial mantle\u001b[0m",
      "room_desc": "\u001b[93mAn imperial mantle lies here.\u001b[0m",
      "description": "A regal mantle.",
      "item_type": "armor",
      "weight": 5,
      "value": 8000,
      "wear_slot": "about",
      "armor_bonus": 2,
      "affects": [
        {
          "type": "cha",
          "value": 1
        }
      ],
      "set_id": 120
    }
  }
}